{"input":"Context: Wumpuses are grimpuses. Everything that is an impus or a vumpus or a rompus is a wumpus, a lorpus, and a yumpus. Everything that is an impus or a vumpus or a rompus is a brimpus. Everything that is a jompus, a rompus, or a tumpus is a gorpus. Yumpuses are zumpuses. Polly is a gorpus. Polly is a rompus.\nQuestion: Polly is a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a rompus.","Polly is an impus, a vumpus, or a rompus.","Everything that is an impus or a vumpus or a rompus is a wumpus, a lorpus, and a yumpus.","Polly is a wumpus and a lorpus and a yumpus.","Polly is a lorpus."]}
{"input":"Context: Each rompus is a sterpus. Lempuses are lorpuses, impuses, and rompuses. Everything that is an impus or a dumpus or a yumpus is a sterpus. Every lorpus is a tumpus. Lempuses are tumpuses. Stella is a jompus. Stella is a lempus.\nQuestion: Stella is a gorpus, a zumpus, or an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a lempus.","Lempuses are lorpuses, impuses, and rompuses.","Stella is a lorpus and an impus and a rompus.","Stella is an impus.","Stella is a gorpus or a zumpus or an impus."]}
{"input":"Context: Everything that is a lempus or a jompus or a brimpus is a yumpus. Everything that is a rompus or a jompus or a vumpus is a sterpus. Tumpuses are lempuses. Sally is a lorpus. Every zumpus is a lorpus. Each lorpus is a sterpus. Everything that is a rompus or a jompus or a vumpus is a brimpus. Sally is a gorpus, a yumpus, and a shumpus. Sally is a zumpus and Sally is not a sterpus and Sally is a tumpus.\nQuestion: Sally is not a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a zumpus, Sally is not a sterpus, and Sally is a tumpus.","Sally is not a sterpus.\n\n","Assume Sally is a jompus.","Sally is a rompus, a jompus, or a vumpus.","Everything that is a rompus or a jompus or a vumpus is a sterpus.","Sally is a sterpus.","This contradicts with Sally is not a sterpus.","Sally is not a jompus.\n\n"]}
{"input":"Context: Numpuses are lorpuses. Fae is a dumpus. Fae is a rompus. Everything that is a dumpus and a lempus and a yumpus is a grimpus. Fae is a sterpus. Jompuses are vumpuses. Everything that is a sterpus, a dumpus, and a rompus is a lorpus. Everything that is a dumpus and a lempus and a yumpus is a jompus, a numpus, and a tumpus. Fae is a dumpus. Fae is a lempus. Fae is a sterpus. Fae is a yumpus.\nQuestion: Fae is a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a yumpus.","Fae is a lempus.","Fae is a dumpus.","Fae is a dumpus, a lempus, and a yumpus.","Everything that is a dumpus and a lempus and a yumpus is a jompus, a numpus, and a tumpus.","Fae is a jompus and a numpus and a tumpus.","Fae is a tumpus."]}
{"input":"Context: Every wumpus is a lempus. Everything that is a zumpus, a yumpus, and a jompus is a lempus. Max is a zumpus. Lorpuses are vumpuses. Jompuses are numpuses. Each lorpus is a wumpus and a jompus and an impus. Max is a lempus. Everything that is a zumpus and a lempus and a shumpus is a vumpus. Lempuses are impuses. Everything that is a zumpus, a yumpus, and a jompus is not an impus. Max is a shumpus. Max is a zumpus. Max is a dumpus. Max is a yumpus. Max is a jompus.\nQuestion: Max is not a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a jompus.","Max is a yumpus.","Max is a zumpus.","Max is a zumpus, a yumpus, and a jompus.","Everything that is a zumpus, a yumpus, and a jompus is not an impus.","Max is not an impus.\n\n","Assume Max is a lorpus.","Each lorpus is a wumpus and a jompus and an impus.","Max is a wumpus and a jompus and an impus.","Max is an impus.","This contradicts with Max is not an impus.","Max is not a lorpus.\n\n"]}
{"input":"Context: Each tumpus is a jompus. Gorpuses are grimpuses. Lempuses are yumpuses. Lorpuses are brimpuses, jompuses, and impuses. Each impus is a numpus. Every lorpus is a shumpus. Every brimpus is a vumpus. Polly is a tumpus. Polly is a wumpus and a shumpus and a numpus. Polly is a gorpus, Polly is a lempus, and Polly is not a jompus.\nQuestion: Polly is not a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a gorpus, Polly is a lempus, and Polly is not a jompus.","Polly is not a jompus.\n\n","Assume Polly is a lorpus.","Lorpuses are brimpuses, jompuses, and impuses.","Polly is a brimpus, a jompus, and an impus.","Polly is a jompus.","This contradicts with Polly is not a jompus.","Polly is not a lorpus.\n\n"]}
{"input":"Context: Each gorpus is a brimpus. Everything that is a lempus and a rompus and a sterpus is a grimpus. Each wumpus is a shumpus. Every jompus is a lempus. Every jompus is a zumpus. Vumpuses are lorpuses. Each dumpus is a yumpus. Each impus is a gorpus. Sally is a lempus. Sally is a sterpus. Sally is a rompus. Sally is a shumpus, a zumpus, and a sterpus. Sally is a wumpus, a jompus, and a vumpus. Sally is not a yumpus, Sally is a tumpus, and Sally is a jompus. Sally is an impus.\nQuestion: Sally is a lempus, Sally is not a dumpus, and Sally is a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is an impus.","Each impus is a gorpus.","Sally is a gorpus.","Each gorpus is a brimpus.","Sally is a brimpus.","Sally is not a yumpus and Sally is a tumpus and Sally is a jompus.","Sally is not a yumpus.\n\n","Assume Sally is a dumpus.","Each dumpus is a yumpus.","Sally is a yumpus.","This contradicts with Sally is not a yumpus.","Sally is not a dumpus.\n\n","Sally is a wumpus, a jompus, and a vumpus.","Sally is a jompus.","Every jompus is a lempus.","Sally is a lempus.","Sally is a lempus, Sally is not a dumpus, and Sally is a brimpus."]}
{"input":"Context: Everything that is a yumpus, a sterpus, and a lorpus is a dumpus. Everything that is a dumpus, a yumpus, and a lempus is a brimpus. Wren is a lempus. Each jompus is a rompus. Everything that is a yumpus and a sterpus and a lorpus is a tumpus and a gorpus and a jompus. Wren is a dumpus. Each gorpus is an impus. Wren is a yumpus. Wren is a yumpus. Wren is a sterpus. Wren is a brimpus. Wren is a lorpus.\nQuestion: Wren is a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a lorpus.","Wren is a sterpus.","Wren is a yumpus.","Wren is a yumpus, a sterpus, and a lorpus.","Everything that is a yumpus and a sterpus and a lorpus is a tumpus and a gorpus and a jompus.","Wren is a tumpus, a gorpus, and a jompus.","Wren is a tumpus."]}
{"input":"Context: Everything that is a shumpus or a jompus or a vumpus is a sterpus. Everything that is a shumpus, a jompus, or a vumpus is a grimpus, a brimpus, and a rompus. Everything that is a zumpus, a shumpus, or a lorpus is a sterpus. Every rompus is a gorpus. Brimpuses are sterpuses. Polly is a tumpus. Polly is a shumpus.\nQuestion: Polly is a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a shumpus.","Polly is a shumpus or a jompus or a vumpus.","Everything that is a shumpus, a jompus, or a vumpus is a grimpus, a brimpus, and a rompus.","Polly is a grimpus, a brimpus, and a rompus.","Polly is a grimpus."]}
{"input":"Context: Polly is a sterpus. Every grimpus is a jompus. Tumpuses are yumpuses. Rompuses are not wumpuses. Polly is a vumpus. Everything that is a sterpus, a vumpus, and a shumpus is a brimpus. Polly is a shumpus. Grimpuses are sterpuses. Every zumpus is a wumpus. Everything that is an impus or a rompus or a zumpus is a numpus. Each lempus is a vumpus. Polly is a jompus and a yumpus and a vumpus. Polly is a grimpus and a lempus and a tumpus. Polly is a rompus. Polly is a rompus.\nQuestion: Polly is a sterpus, Polly is not a zumpus, and Polly is a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a rompus.","Polly is an impus or a rompus or a zumpus.","Everything that is an impus or a rompus or a zumpus is a numpus.","Polly is a numpus.","Polly is a rompus.","Rompuses are not wumpuses.","Polly is not a wumpus.\n\n","Assume Polly is a zumpus.","Every zumpus is a wumpus.","Polly is a wumpus.","This contradicts with Polly is not a wumpus.","Polly is not a zumpus.\n\n","Polly is a grimpus and a lempus and a tumpus.","Polly is a grimpus.","Grimpuses are sterpuses.","Polly is a sterpus.","Polly is a sterpus and Polly is not a zumpus and Polly is a numpus."]}
{"input":"Context: Tumpuses are vumpuses. Rompuses are grimpuses and impuses and tumpuses. Grimpuses are jompuses. Everything that is a shumpus, an impus, or a yumpus is a numpus. Each rompus is a zumpus. Alex is a jompus. Alex is a rompus.\nQuestion: Alex is an impus, a brimpus, or a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a rompus.","Rompuses are grimpuses and impuses and tumpuses.","Alex is a grimpus and an impus and a tumpus.","Alex is an impus.","Alex is an impus or a brimpus or a gorpus."]}
{"input":"Context: Everything that is a lempus, a zumpus, or a numpus is a dumpus. Everything that is a brimpus, a sterpus, or a zumpus is a grimpus. Everything that is a brimpus or a sterpus or a zumpus is a vumpus. Gorpuses are shumpuses. Every brimpus is a wumpus. Sam is a lempus and a rompus and a jompus. Sam is a gorpus, a brimpus, and a zumpus.\nQuestion: Sam is a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a gorpus and a brimpus and a zumpus.","Sam is a zumpus.","Sam is a brimpus, a sterpus, or a zumpus.","Everything that is a brimpus, a sterpus, or a zumpus is a grimpus.","Sam is a grimpus."]}
{"input":"Context: Gorpuses are yumpuses. Every brimpus is a vumpus. Each lempus is a rompus. Gorpuses are dumpuses. Each shumpus is a jompus. Fae is a brimpus. Each numpus is a rompus. Lempuses are vumpuses, shumpuses, and gorpuses. Fae is a lorpus, a jompus, and a yumpus. Fae is a numpus and Fae is not a vumpus and Fae is a gorpus.\nQuestion: Fae is not a lempus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a numpus and Fae is not a vumpus and Fae is a gorpus.","Fae is not a vumpus.\n\n","Assume Fae is a lempus.","Lempuses are vumpuses, shumpuses, and gorpuses.","Fae is a vumpus, a shumpus, and a gorpus.","Fae is a vumpus.","This contradicts with Fae is not a vumpus.","Fae is not a lempus.\n\n"]}
{"input":"Context: Every sterpus is a yumpus. Polly is a grimpus. Lorpuses are lempuses. Numpuses are gorpuses. Every shumpus is a sterpus, a vumpus, and a numpus. Each shumpus is a yumpus. Grimpuses are vumpuses. Every dumpus is a jompus. Polly is a jompus, a brimpus, and a wumpus. Polly is a dumpus and Polly is not a vumpus and Polly is a lorpus.\nQuestion: Polly is not a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a dumpus and Polly is not a vumpus and Polly is a lorpus.","Polly is not a vumpus.\n\n","Assume Polly is a shumpus.","Every shumpus is a sterpus, a vumpus, and a numpus.","Polly is a sterpus and a vumpus and a numpus.","Polly is a vumpus.","This contradicts with Polly is not a vumpus.","Polly is not a shumpus.\n\n"]}
{"input":"Context: Each yumpus is a shumpus. Everything that is a lorpus or a lempus or a jompus is a dumpus. Everything that is a lempus, a vumpus, or a dumpus is a rompus. Everything that is a lorpus, a lempus, or a jompus is a brimpus. Numpuses are zumpuses. Alex is a dumpus and a grimpus and a vumpus. Alex is a yumpus and a lempus and a numpus.\nQuestion: Alex is a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a yumpus and a lempus and a numpus.","Alex is a lempus.","Alex is a lorpus or a lempus or a jompus.","Everything that is a lorpus, a lempus, or a jompus is a brimpus.","Alex is a brimpus."]}
{"input":"Context: Lempuses are numpuses. Alex is a numpus. Everything that is a shumpus and an impus and a numpus is a yumpus. Jompuses are vumpuses. Everything that is an impus and a wumpus and a dumpus is not a vumpus. Shumpuses are vumpuses. Lempuses are jompuses. Everything that is an impus and a wumpus and a dumpus is a brimpus. Alex is a shumpus. Alex is an impus. Every jompus is a gorpus. Alex is an impus. Alex is a shumpus. Alex is a wumpus. Alex is a dumpus.\nQuestion: Alex is not a lempus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a dumpus.","Alex is a wumpus.","Alex is an impus.","Alex is an impus and a wumpus and a dumpus.","Everything that is an impus and a wumpus and a dumpus is not a vumpus.","Alex is not a vumpus.\n\n","Assume Alex is a lempus.","Lempuses are jompuses.","Alex is a jompus.","Jompuses are vumpuses.","Alex is a vumpus.","This contradicts with Alex is not a vumpus.","Alex is not a lempus.\n\n"]}
{"input":"Context: Shumpuses are tumpuses. Shumpuses are zumpuses. Gorpuses are yumpuses. Every sterpus is a wumpus. Tumpuses are vumpuses. Tumpuses are not rompuses. Gorpuses are lempuses, rompuses, and sterpuses. Every brimpus is a rompus. Polly is a brimpus. Every lempus is a dumpus. Polly is a vumpus. Polly is a shumpus.\nQuestion: Polly is not a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a shumpus.","Shumpuses are tumpuses.","Polly is a tumpus.","Tumpuses are not rompuses.","Polly is not a rompus.\n\n","Assume Polly is a gorpus.","Gorpuses are lempuses, rompuses, and sterpuses.","Polly is a lempus, a rompus, and a sterpus.","Polly is a rompus.","This contradicts with Polly is not a rompus.","Polly is not a gorpus.\n\n"]}
{"input":"Context: Everything that is a dumpus, a shumpus, or a sterpus is a zumpus. Everything that is a dumpus, a shumpus, or a sterpus is a brimpus, a tumpus, and a jompus. Every tumpus is a vumpus. Every brimpus is a lempus. Everything that is a zumpus, a dumpus, or a wumpus is a gorpus. Rex is an impus. Rex is a dumpus.\nQuestion: Rex is a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a dumpus.","Rex is a dumpus or a shumpus or a sterpus.","Everything that is a dumpus, a shumpus, or a sterpus is a brimpus, a tumpus, and a jompus.","Rex is a brimpus and a tumpus and a jompus.","Rex is a jompus."]}
{"input":"Context: Everything that is a sterpus, a brimpus, or a jompus is an impus. Everything that is a sterpus or a shumpus or a zumpus is a dumpus. Everything that is a sterpus or a brimpus or a jompus is a wumpus. Each rompus is a shumpus. Jompuses are yumpuses. Polly is a shumpus and a grimpus and a vumpus. Polly is a rompus and a sterpus and a jompus.\nQuestion: Polly is a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a rompus, a sterpus, and a jompus.","Polly is a sterpus.","Polly is a sterpus, a brimpus, or a jompus.","Everything that is a sterpus or a brimpus or a jompus is a wumpus.","Polly is a wumpus."]}
{"input":"Context: Grimpuses are rompuses, vumpuses, and wumpuses. Every rompus is a lorpus. Everything that is an impus, a vumpus, or a numpus is a shumpus. Every grimpus is a brimpus. Wumpuses are jompuses. Polly is a numpus. Polly is a grimpus.\nQuestion: Polly is a tumpus, a vumpus, or a dumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a grimpus.","Grimpuses are rompuses, vumpuses, and wumpuses.","Polly is a rompus and a vumpus and a wumpus.","Polly is a vumpus.","Polly is a tumpus, a vumpus, or a dumpus."]}
{"input":"Context: Every brimpus is a lempus. Stella is a lempus. Each zumpus is a yumpus. Dumpuses are tumpuses. Every lempus is a shumpus. Every brimpus is a shumpus and a zumpus and a dumpus. Each gorpus is a lorpus. Dumpuses are sterpuses. Stella is a grimpus, a jompus, and a numpus. Stella is a dumpus, Stella is not a shumpus, and Stella is a gorpus.\nQuestion: Stella is not a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a dumpus, Stella is not a shumpus, and Stella is a gorpus.","Stella is not a shumpus.\n\n","Assume Stella is a brimpus.","Every brimpus is a shumpus and a zumpus and a dumpus.","Stella is a shumpus and a zumpus and a dumpus.","Stella is a shumpus.","This contradicts with Stella is not a shumpus.","Stella is not a brimpus.\n\n"]}
{"input":"Context: Every rompus is a brimpus. Everything that is a dumpus or a brimpus or a wumpus is a sterpus. Lempuses are gorpuses. Every impus is a zumpus. Every rompus is a dumpus. Rex is a numpus, a wumpus, and a sterpus. Rex is a lempus, an impus, and a rompus.\nQuestion: Rex is a brimpus or a rompus or a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a lempus, an impus, and a rompus.","Rex is a rompus.","Every rompus is a brimpus.","Rex is a brimpus.","Rex is a brimpus, a rompus, or a vumpus."]}
{"input":"Context: Sterpuses are grimpuses. Max is a sterpus. Each wumpus is a tumpus. Dumpuses are shumpuses. Each gorpus is a brimpus. Each numpus is a yumpus. Each wumpus is a sterpus. Every dumpus is a wumpus and a numpus and a grimpus. Max is a vumpus and a brimpus and a tumpus. Max is not a grimpus and Max is a gorpus and Max is a wumpus.\nQuestion: Max is not a dumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is not a grimpus and Max is a gorpus and Max is a wumpus.","Max is not a grimpus.\n\n","Assume Max is a dumpus.","Every dumpus is a wumpus and a numpus and a grimpus.","Max is a wumpus and a numpus and a grimpus.","Max is a grimpus.","This contradicts with Max is not a grimpus.","Max is not a dumpus.\n\n"]}
{"input":"Context: Tumpuses are rompuses. Every yumpus is a numpus, a gorpus, and a rompus. Numpuses are sterpuses. Yumpuses are jompuses. Each gorpus is a lorpus. Each lempus is a brimpus. Stella is a tumpus. Every wumpus is a zumpus. Stella is a tumpus, a shumpus, and a lorpus. Stella is not a rompus and Stella is a wumpus and Stella is a lempus.\nQuestion: Stella is not a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is not a rompus and Stella is a wumpus and Stella is a lempus.","Stella is not a rompus.\n\n","Assume Stella is a yumpus.","Every yumpus is a numpus, a gorpus, and a rompus.","Stella is a numpus and a gorpus and a rompus.","Stella is a rompus.","This contradicts with Stella is not a rompus.","Stella is not a yumpus.\n\n"]}
{"input":"Context: Dumpuses are wumpuses. Everything that is a tumpus and a gorpus and a lempus is an impus. Polly is a lempus. Every zumpus is a rompus. Grimpuses are tumpuses. Polly is a dumpus. Polly is a gorpus. Everything that is a gorpus and a grimpus and a yumpus is a wumpus. Each vumpus is a shumpus. Polly is a tumpus. Everything that is a gorpus and a grimpus and a yumpus is a rompus. Each vumpus is not a wumpus. Polly is a grimpus and a zumpus and a vumpus. Polly is a dumpus and a tumpus and a numpus. Polly is a grimpus. Polly is a yumpus.\nQuestion: Polly is not a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a grimpus, a zumpus, and a vumpus.","Polly is a vumpus.","Each vumpus is not a wumpus.","Polly is not a wumpus.","Polly is a yumpus.","Polly is a grimpus.\n\n","Assume Polly is a gorpus.","Polly is a gorpus, a grimpus, and a yumpus.","Everything that is a gorpus and a grimpus and a yumpus is a wumpus.","Polly is a wumpus.","This contradicts with Polly is not a wumpus.","Polly is not a gorpus.\n\n"]}
{"input":"Context: Each zumpus is a tumpus. Every dumpus is a sterpus. Every zumpus is a grimpus. Rompuses are lorpuses. Everything that is a lorpus or a grimpus or a wumpus is a vumpus. Polly is an impus, a numpus, and a lorpus. Polly is a rompus and a zumpus and a dumpus.\nQuestion: Polly is a shumpus or a grimpus or a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a rompus and a zumpus and a dumpus.","Polly is a zumpus.","Every zumpus is a grimpus.","Polly is a grimpus.","Polly is a shumpus or a grimpus or a brimpus."]}
{"input":"Context: Sterpuses are numpuses. Each gorpus is a dumpus. Every zumpus is a brimpus. Everything that is a dumpus or a jompus or a wumpus is a lempus. Every gorpus is a tumpus. Wren is a numpus and a vumpus and a jompus. Wren is a sterpus, a zumpus, and a gorpus.\nQuestion: Wren is a sterpus, a dumpus, or an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a sterpus, a zumpus, and a gorpus.","Wren is a gorpus.","Each gorpus is a dumpus.","Wren is a dumpus.","Wren is a sterpus or a dumpus or an impus."]}
{"input":"Context: Everything that is a dumpus, a lempus, and a vumpus is a gorpus. Everything that is a zumpus and a dumpus and a jompus is a brimpus. Polly is a jompus. Polly is a dumpus. Everything that is a dumpus and a lempus and a vumpus is a sterpus and an impus and a lorpus. Polly is a zumpus. Each sterpus is a yumpus. Lorpuses are rompuses. Polly is a dumpus. Polly is a tumpus. Polly is a lempus. Polly is a vumpus.\nQuestion: Polly is an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a vumpus.","Polly is a lempus.","Polly is a dumpus.","Polly is a dumpus, a lempus, and a vumpus.","Everything that is a dumpus and a lempus and a vumpus is a sterpus and an impus and a lorpus.","Polly is a sterpus, an impus, and a lorpus.","Polly is an impus."]}
{"input":"Context: Every brimpus is a wumpus. Numpuses are lorpuses. Everything that is a yumpus, a lempus, or a grimpus is a zumpus. Everything that is a yumpus, a lempus, or a grimpus is a gorpus and a brimpus and a numpus. Everything that is a yumpus, a sterpus, or a lorpus is a wumpus. Sam is a jompus. Sam is a yumpus.\nQuestion: Sam is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a yumpus.","Sam is a yumpus or a lempus or a grimpus.","Everything that is a yumpus, a lempus, or a grimpus is a gorpus and a brimpus and a numpus.","Sam is a gorpus, a brimpus, and a numpus.","Sam is a gorpus."]}
{"input":"Context: Everything that is a wumpus, a lorpus, and a tumpus is a numpus, a zumpus, and a rompus. Rompuses are lempuses. Each numpus is a grimpus. Everything that is a wumpus, a lorpus, and a tumpus is a shumpus. Wren is a jompus. Everything that is a yumpus, a wumpus, and a jompus is an impus. Wren is a wumpus. Wren is a yumpus. Wren is a wumpus. Wren is a lorpus. Wren is a grimpus. Wren is a tumpus.\nQuestion: Wren is a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a tumpus.","Wren is a lorpus.","Wren is a wumpus.","Wren is a wumpus, a lorpus, and a tumpus.","Everything that is a wumpus, a lorpus, and a tumpus is a numpus, a zumpus, and a rompus.","Wren is a numpus and a zumpus and a rompus.","Wren is a zumpus."]}
{"input":"Context: Everything that is a rompus, a numpus, or a dumpus is a grimpus. Numpuses are shumpuses. Everything that is a rompus or a gorpus or a lorpus is a shumpus. Everything that is a rompus, a numpus, or a dumpus is a sterpus. Every vumpus is a sterpus. Sam is a yumpus and a zumpus and a gorpus. Sam is a vumpus, a rompus, and a numpus.\nQuestion: Sam is a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a vumpus and a rompus and a numpus.","Sam is a rompus.","Sam is a rompus or a numpus or a dumpus.","Everything that is a rompus, a numpus, or a dumpus is a grimpus.","Sam is a grimpus."]}
{"input":"Context: Tumpuses are grimpuses. Everything that is a numpus or a rompus or an impus is a sterpus. Lorpuses are jompuses. Each brimpus is a lempus. Brimpuses are tumpuses, numpuses, and lorpuses. Alex is a dumpus. Alex is a brimpus.\nQuestion: Alex is a vumpus or a gorpus or a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a brimpus.","Brimpuses are tumpuses, numpuses, and lorpuses.","Alex is a tumpus and a numpus and a lorpus.","Alex is a numpus.","Alex is a vumpus or a gorpus or a numpus."]}
{"input":"Context: Everything that is a lempus, a jompus, or a brimpus is a gorpus. Lorpuses are impuses. Sterpuses are lorpuses and yumpuses and numpuses. Everything that is a jompus, a vumpus, or a shumpus is not a yumpus. Stella is a dumpus. Every numpus is a lempus. Everything that is a jompus or a vumpus or a shumpus is a lempus. Dumpuses are yumpuses. Sterpuses are grimpuses. Stella is a zumpus. Stella is a jompus.\nQuestion: Stella is not a sterpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a jompus.","Stella is a jompus or a vumpus or a shumpus.","Everything that is a jompus, a vumpus, or a shumpus is not a yumpus.","Stella is not a yumpus.\n\n","Assume Stella is a sterpus.","Sterpuses are lorpuses and yumpuses and numpuses.","Stella is a lorpus and a yumpus and a numpus.","Stella is a yumpus.","This contradicts with Stella is not a yumpus.","Stella is not a sterpus.\n\n"]}
{"input":"Context: Fae is a yumpus. Everything that is a yumpus, a shumpus, and a lorpus is a sterpus and a lempus and a gorpus. Everything that is a dumpus and a yumpus and a rompus is a grimpus. Everything that is a yumpus and a shumpus and a lorpus is an impus. Fae is a dumpus. Lempuses are impuses. Fae is a rompus. Gorpuses are dumpuses. Fae is a yumpus. Fae is an impus. Fae is a shumpus. Fae is a lorpus.\nQuestion: Fae is a sterpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a lorpus.","Fae is a shumpus.","Fae is a yumpus.","Fae is a yumpus, a shumpus, and a lorpus.","Everything that is a yumpus, a shumpus, and a lorpus is a sterpus and a lempus and a gorpus.","Fae is a sterpus and a lempus and a gorpus.","Fae is a sterpus."]}
{"input":"Context: Sally is a numpus. Impuses are shumpuses. Sally is a yumpus. Tumpuses are yumpuses. Everything that is a wumpus and a sterpus and a gorpus is an impus, a zumpus, and a tumpus. Sally is a wumpus. Everything that is a wumpus, a yumpus, and a numpus is a brimpus. Everything that is a wumpus, a sterpus, and a gorpus is a lorpus. Sally is a shumpus. Sally is a wumpus. Sally is a sterpus. Sally is a gorpus.\nQuestion: Sally is a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a gorpus.","Sally is a sterpus.","Sally is a wumpus.","Sally is a wumpus, a sterpus, and a gorpus.","Everything that is a wumpus and a sterpus and a gorpus is an impus, a zumpus, and a tumpus.","Sally is an impus, a zumpus, and a tumpus.","Sally is a zumpus."]}
{"input":"Context: Everything that is a zumpus, a wumpus, or a jompus is a lorpus. Everything that is a zumpus, a rompus, or a vumpus is a lempus. Each dumpus is a tumpus. Grimpuses are lempuses. Everything that is a zumpus or a wumpus or a jompus is a sterpus and a dumpus and a grimpus. Sally is a numpus. Sally is a zumpus.\nQuestion: Sally is a sterpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a zumpus.","Sally is a zumpus or a wumpus or a jompus.","Everything that is a zumpus or a wumpus or a jompus is a sterpus and a dumpus and a grimpus.","Sally is a sterpus and a dumpus and a grimpus.","Sally is a sterpus."]}
{"input":"Context: Each impus is a grimpus. Everything that is a vumpus or a dumpus or a gorpus is a zumpus. Every numpus is a jompus. Everything that is a vumpus or a dumpus or a gorpus is a sterpus. Everything that is a vumpus or a grimpus or a wumpus is a shumpus. Fae is a grimpus and a jompus and a wumpus. Fae is a vumpus and a numpus and an impus.\nQuestion: Fae is a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a vumpus and a numpus and an impus.","Fae is a vumpus.","Fae is a vumpus, a dumpus, or a gorpus.","Everything that is a vumpus or a dumpus or a gorpus is a zumpus.","Fae is a zumpus."]}
{"input":"Context: Everything that is a wumpus or a sterpus or a rompus is a vumpus. Each gorpus is a vumpus. Everything that is a brimpus or a sterpus or an impus is a yumpus. Shumpuses are dumpuses. Everything that is a brimpus, a sterpus, or an impus is a shumpus and a lempus and a gorpus. Stella is a wumpus. Stella is a sterpus.\nQuestion: Stella is a lempus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a sterpus.","Stella is a brimpus, a sterpus, or an impus.","Everything that is a brimpus, a sterpus, or an impus is a shumpus and a lempus and a gorpus.","Stella is a shumpus, a lempus, and a gorpus.","Stella is a lempus."]}
{"input":"Context: Jompuses are grimpuses. Each shumpus is a lempus. Sam is a dumpus. Jompuses are yumpuses and shumpuses and brimpuses. Numpuses are wumpuses. Brimpuses are impuses. Vumpuses are impuses. Each dumpus is a yumpus. Sam is a tumpus, a sterpus, and a grimpus. Sam is a vumpus and Sam is a numpus and Sam is not a yumpus.\nQuestion: Sam is not a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a vumpus and Sam is a numpus and Sam is not a yumpus.","Sam is not a yumpus.\n\n","Assume Sam is a jompus.","Jompuses are yumpuses and shumpuses and brimpuses.","Sam is a yumpus, a shumpus, and a brimpus.","Sam is a yumpus.","This contradicts with Sam is not a yumpus.","Sam is not a jompus.\n\n"]}
{"input":"Context: Brimpuses are sterpuses. Each grimpus is a vumpus. Each shumpus is an impus. Each brimpus is a rompus. Everything that is a lempus or a sterpus or a wumpus is a rompus. Polly is an impus, a gorpus, and a lempus. Polly is a shumpus and a brimpus and a grimpus.\nQuestion: Polly is a sterpus or a numpus or a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a shumpus and a brimpus and a grimpus.","Polly is a brimpus.","Brimpuses are sterpuses.","Polly is a sterpus.","Polly is a sterpus, a numpus, or a jompus."]}
{"input":"Context: Numpuses are zumpuses. Everything that is a zumpus, a grimpus, or a wumpus is a tumpus. Sterpuses are gorpuses. Everything that is an impus or a grimpus or a jompus is a shumpus. Everything that is an impus, a grimpus, or a jompus is a lempus. Wren is a gorpus and a shumpus and a tumpus. Wren is a sterpus and a numpus and a grimpus.\nQuestion: Wren is a lempus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a sterpus and a numpus and a grimpus.","Wren is a grimpus.","Wren is an impus, a grimpus, or a jompus.","Everything that is an impus, a grimpus, or a jompus is a lempus.","Wren is a lempus."]}
{"input":"Context: Everything that is a dumpus and a tumpus and a shumpus is a wumpus. Numpuses are yumpuses, sterpuses, and shumpuses. Jompuses are yumpuses. Shumpuses are lorpuses. Rex is a grimpus. Rex is a lorpus. Rex is a dumpus. Each numpus is a gorpus. Each sterpus is an impus. Everything that is a dumpus and a tumpus and a shumpus is not a yumpus. Everything that is a grimpus, a dumpus, and a lorpus is a jompus. Rex is a jompus. Rex is a dumpus. Rex is a vumpus. Rex is a tumpus. Rex is a shumpus.\nQuestion: Rex is not a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a shumpus.","Rex is a tumpus.","Rex is a dumpus.","Rex is a dumpus and a tumpus and a shumpus.","Everything that is a dumpus and a tumpus and a shumpus is not a yumpus.","Rex is not a yumpus.\n\n","Assume Rex is a numpus.","Numpuses are yumpuses, sterpuses, and shumpuses.","Rex is a yumpus, a sterpus, and a shumpus.","Rex is a yumpus.","This contradicts with Rex is not a yumpus.","Rex is not a numpus.\n\n"]}
{"input":"Context: Every lorpus is a gorpus. Wren is a gorpus. Vumpuses are rompuses. Each sterpus is a grimpus. Every yumpus is a gorpus. Each vumpus is a jompus, a yumpus, and a sterpus. Every wumpus is a tumpus. Each wumpus is not a jompus. Each lorpus is a wumpus. Every gorpus is a jompus. Wren is a tumpus. Wren is a lorpus.\nQuestion: Wren is not a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a lorpus.","Each lorpus is a wumpus.","Wren is a wumpus.","Each wumpus is not a jompus.","Wren is not a jompus.\n\n","Assume Wren is a vumpus.","Each vumpus is a jompus, a yumpus, and a sterpus.","Wren is a jompus and a yumpus and a sterpus.","Wren is a jompus.","This contradicts with Wren is not a jompus.","Wren is not a vumpus.\n\n"]}
{"input":"Context: Vumpuses are rompuses. Jompuses are rompuses. Jompuses are tumpuses, yumpuses, and vumpuses. Everything that is a wumpus or a tumpus or a dumpus is a zumpus. Yumpuses are sterpuses. Sam is a wumpus. Sam is a jompus.\nQuestion: Sam is a gorpus or a grimpus or a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a jompus.","Jompuses are tumpuses, yumpuses, and vumpuses.","Sam is a tumpus and a yumpus and a vumpus.","Sam is a tumpus.","Sam is a gorpus or a grimpus or a tumpus."]}
{"input":"Context: Every wumpus is a numpus. Lempuses are shumpuses. Alex is a jompus. Every lorpus is an impus. Lorpuses are lempuses, yumpuses, and sterpuses. Each yumpus is a grimpus. Tumpuses are shumpuses. Jompuses are sterpuses. Alex is a vumpus, a jompus, and an impus. Alex is a tumpus, Alex is a wumpus, and Alex is not a sterpus.\nQuestion: Alex is not a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a tumpus and Alex is a wumpus and Alex is not a sterpus.","Alex is not a sterpus.\n\n","Assume Alex is a lorpus.","Lorpuses are lempuses, yumpuses, and sterpuses.","Alex is a lempus and a yumpus and a sterpus.","Alex is a sterpus.","This contradicts with Alex is not a sterpus.","Alex is not a lorpus.\n\n"]}
{"input":"Context: Everything that is an impus, a grimpus, and a lempus is a rompus. Everything that is an impus, a numpus, and a tumpus is a rompus. Everything that is an impus, a numpus, and a tumpus is a yumpus and a lorpus and a gorpus. Polly is a lempus. Polly is a grimpus. Polly is an impus. Each gorpus is a vumpus. Every lorpus is a rompus. Polly is an impus. Polly is a brimpus. Polly is a numpus. Polly is a tumpus.\nQuestion: Polly is a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a tumpus.","Polly is a numpus.","Polly is an impus.","Polly is an impus, a numpus, and a tumpus.","Everything that is an impus, a numpus, and a tumpus is a yumpus and a lorpus and a gorpus.","Polly is a yumpus, a lorpus, and a gorpus.","Polly is a yumpus."]}
{"input":"Context: Each vumpus is a sterpus. Rompuses are shumpuses. Grimpuses are shumpuses. Max is a vumpus. Each zumpus is a rompus. Every gorpus is a numpus. Every grimpus is a sterpus and a gorpus and a dumpus. Dumpuses are vumpuses. Zumpuses are wumpuses. Every rompus is not a sterpus. Max is a vumpus. Max is a zumpus.\nQuestion: Max is not a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a zumpus.","Each zumpus is a rompus.","Max is a rompus.","Every rompus is not a sterpus.","Max is not a sterpus.\n\n","Assume Max is a grimpus.","Every grimpus is a sterpus and a gorpus and a dumpus.","Max is a sterpus and a gorpus and a dumpus.","Max is a sterpus.","This contradicts with Max is not a sterpus.","Max is not a grimpus.\n\n"]}
{"input":"Context: Gorpuses are wumpuses. Yumpuses are numpuses. Everything that is a dumpus or a lorpus or a sterpus is a zumpus. Everything that is a dumpus or a lorpus or a sterpus is a brimpus, a gorpus, and a yumpus. Everything that is a lempus, a lorpus, or a wumpus is a shumpus. Max is a lempus. Max is a lorpus.\nQuestion: Max is a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a lorpus.","Max is a dumpus or a lorpus or a sterpus.","Everything that is a dumpus or a lorpus or a sterpus is a brimpus, a gorpus, and a yumpus.","Max is a brimpus, a gorpus, and a yumpus.","Max is a brimpus."]}
{"input":"Context: Wumpuses are vumpuses. Everything that is a shumpus, a gorpus, or an impus is a rompus. Every brimpus is an impus. Brimpuses are gorpuses, grimpuses, and wumpuses. Grimpuses are dumpuses. Sally is a yumpus. Sally is a brimpus.\nQuestion: Sally is a gorpus or a jompus or a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a brimpus.","Brimpuses are gorpuses, grimpuses, and wumpuses.","Sally is a gorpus and a grimpus and a wumpus.","Sally is a gorpus.","Sally is a gorpus or a jompus or a wumpus."]}
{"input":"Context: Each jompus is a wumpus. Each rompus is an impus. Grimpuses are yumpuses. Everything that is a vumpus, a zumpus, or a yumpus is a gorpus. Every jompus is a rompus and a zumpus and a grimpus. Rex is a wumpus. Rex is a jompus.\nQuestion: Rex is a shumpus, a grimpus, or a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a jompus.","Every jompus is a rompus and a zumpus and a grimpus.","Rex is a rompus, a zumpus, and a grimpus.","Rex is a zumpus.","Rex is a shumpus or a grimpus or a zumpus."]}
{"input":"Context: Everything that is a rompus, a wumpus, or a shumpus is a tumpus. Everything that is a rompus or a wumpus or a shumpus is a yumpus. Everything that is a gorpus or a rompus or a vumpus is a sterpus. Each numpus is a lorpus. Dumpuses are jompuses. Alex is a vumpus and a brimpus and a sterpus. Alex is a numpus and a rompus and a dumpus.\nQuestion: Alex is a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a numpus and a rompus and a dumpus.","Alex is a rompus.","Alex is a rompus, a wumpus, or a shumpus.","Everything that is a rompus or a wumpus or a shumpus is a yumpus.","Alex is a yumpus."]}
{"input":"Context: Everything that is a lempus, a shumpus, or a yumpus is a sterpus. Everything that is a lempus or a shumpus or a yumpus is an impus. Everything that is a dumpus, a shumpus, or a rompus is a jompus. Max is a numpus. Tumpuses are numpuses. Each zumpus is a rompus. Numpuses are impuses. Max is a jompus, a vumpus, and a gorpus. Max is a zumpus and Max is a tumpus and Max is not an impus.\nQuestion: Max is not a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a zumpus, Max is a tumpus, and Max is not an impus.","Max is not an impus.\n\n","Assume Max is a shumpus.","Max is a lempus, a shumpus, or a yumpus.","Everything that is a lempus or a shumpus or a yumpus is an impus.","Max is an impus.","This contradicts with Max is not an impus.","Max is not a shumpus.\n\n"]}
{"input":"Context: Every impus is a jompus, a sterpus, and a yumpus. Yumpuses are brimpuses. Each impus is a vumpus. Every jompus is a lempus. Everything that is a rompus or a sterpus or a tumpus is a wumpus. Stella is a brimpus. Stella is an impus.\nQuestion: Stella is a lorpus or a sterpus or a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is an impus.","Every impus is a jompus, a sterpus, and a yumpus.","Stella is a jompus, a sterpus, and a yumpus.","Stella is a sterpus.","Stella is a lorpus, a sterpus, or a shumpus."]}
{"input":"Context: Numpuses are lempuses. Alex is a dumpus. Everything that is a shumpus and a dumpus and a tumpus is an impus. Everything that is a shumpus, a grimpus, and a jompus is not a lempus. Each zumpus is a brimpus. Every lorpus is a brimpus. Everything that is a shumpus and a grimpus and a jompus is a wumpus. Zumpuses are lempuses and lorpuses and yumpuses. Alex is a tumpus. Yumpuses are sterpuses. Alex is a shumpus. Alex is a numpus. Alex is a shumpus. Alex is a grimpus. Alex is a numpus. Alex is a jompus.\nQuestion: Alex is not a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a jompus.","Alex is a grimpus.","Alex is a shumpus.","Alex is a shumpus and a grimpus and a jompus.","Everything that is a shumpus, a grimpus, and a jompus is not a lempus.","Alex is not a lempus.\n\n","Assume Alex is a zumpus.","Zumpuses are lempuses and lorpuses and yumpuses.","Alex is a lempus, a lorpus, and a yumpus.","Alex is a lempus.","This contradicts with Alex is not a lempus.","Alex is not a zumpus.\n\n"]}
{"input":"Context: Dumpuses are impuses. Rex is a numpus. Wumpuses are rompuses and lempuses and tumpuses. Wumpuses are yumpuses. Every rompus is a brimpus. Each lempus is a grimpus. Shumpuses are lorpuses. Numpuses are tumpuses. Rex is a brimpus, an impus, and a grimpus. Rex is a dumpus and Rex is a shumpus and Rex is not a tumpus.\nQuestion: Rex is not a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a dumpus and Rex is a shumpus and Rex is not a tumpus.","Rex is not a tumpus.\n\n","Assume Rex is a wumpus.","Wumpuses are rompuses and lempuses and tumpuses.","Rex is a rompus, a lempus, and a tumpus.","Rex is a tumpus.","This contradicts with Rex is not a tumpus.","Rex is not a wumpus.\n\n"]}
{"input":"Context: Alex is a lorpus. Everything that is a shumpus and a brimpus and a wumpus is an impus. Alex is a shumpus. Every vumpus is an impus. Dumpuses are yumpuses. Everything that is a shumpus, a brimpus, and a wumpus is a dumpus, a numpus, and a vumpus. Everything that is a jompus and a shumpus and a lorpus is a lempus. Alex is a jompus. Alex is a shumpus. Alex is a brimpus. Alex is a lorpus. Alex is a wumpus.\nQuestion: Alex is a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a wumpus.","Alex is a brimpus.","Alex is a shumpus.","Alex is a shumpus and a brimpus and a wumpus.","Everything that is a shumpus, a brimpus, and a wumpus is a dumpus, a numpus, and a vumpus.","Alex is a dumpus and a numpus and a vumpus.","Alex is a numpus."]}
{"input":"Context: Yumpuses are lorpuses. Every grimpus is a numpus and a jompus and a yumpus. Everything that is a numpus, a gorpus, or a zumpus is a sterpus. Grimpuses are brimpuses. Every jompus is a gorpus. Sam is a zumpus. Sam is a grimpus.\nQuestion: Sam is a shumpus, a rompus, or a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a grimpus.","Every grimpus is a numpus and a jompus and a yumpus.","Sam is a numpus, a jompus, and a yumpus.","Sam is a numpus.","Sam is a shumpus or a rompus or a numpus."]}
{"input":"Context: Everything that is a yumpus, a rompus, and a lorpus is a tumpus. Everything that is a yumpus, a rompus, and a lorpus is a vumpus. Each vumpus is a tumpus. Everything that is an impus, a grimpus, or a shumpus is not a tumpus. Everything that is an impus or a grimpus or a shumpus is a brimpus. Everything that is a grimpus, a numpus, or a gorpus is a brimpus. Stella is a wumpus. Stella is a yumpus. Stella is a vumpus. Everything that is a yumpus, a vumpus, and a wumpus is a jompus. Stella is a grimpus. Stella is a brimpus. Stella is a rompus. Stella is a lorpus.\nQuestion: Stella is not a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a grimpus.","Stella is an impus or a grimpus or a shumpus.","Everything that is an impus, a grimpus, or a shumpus is not a tumpus.","Stella is not a tumpus.","Stella is a lorpus.","Stella is a rompus.\n\n","Assume Stella is a yumpus.","Stella is a yumpus, a rompus, and a lorpus.","Everything that is a yumpus, a rompus, and a lorpus is a tumpus.","Stella is a tumpus.","This contradicts with Stella is not a tumpus.","Stella is not a yumpus.\n\n"]}
{"input":"Context: Each lempus is a numpus. Sterpuses are tumpuses. Polly is a shumpus. Impuses are tumpuses. Each lempus is a zumpus. Each shumpus is a zumpus. Every jompus is a rompus. Sterpuses are lempuses. Polly is a dumpus and a yumpus and a gorpus. Polly is not a zumpus and Polly is an impus and Polly is a jompus.\nQuestion: Polly is not a sterpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is not a zumpus and Polly is an impus and Polly is a jompus.","Polly is not a zumpus.\n\n","Assume Polly is a sterpus.","Sterpuses are lempuses.","Polly is a lempus.","Each lempus is a zumpus.","Polly is a zumpus.","This contradicts with Polly is not a zumpus.","Polly is not a sterpus.\n\n"]}
{"input":"Context: Each sterpus is a rompus. Rex is a numpus. Each yumpus is a wumpus. Rex is a grimpus. Everything that is a grimpus, a lempus, and a jompus is a tumpus and a sterpus and a yumpus. Everything that is a grimpus and a lempus and a jompus is a numpus. Everything that is a dumpus, a grimpus, and a numpus is a shumpus. Rex is a dumpus. Rex is a grimpus. Rex is an impus. Rex is a lempus. Rex is a jompus.\nQuestion: Rex is a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a jompus.","Rex is a lempus.","Rex is a grimpus.","Rex is a grimpus, a lempus, and a jompus.","Everything that is a grimpus, a lempus, and a jompus is a tumpus and a sterpus and a yumpus.","Rex is a tumpus and a sterpus and a yumpus.","Rex is a tumpus."]}
{"input":"Context: Every lempus is a yumpus. Sally is a shumpus. Everything that is a rompus or a wumpus or a zumpus is a brimpus. Everything that is a rompus or a grimpus or a jompus is a sterpus. Everything that is a rompus, a grimpus, or a jompus is a tumpus. Lempuses are gorpuses. Yumpuses are not sterpuses. Each yumpus is a vumpus. Every shumpus is a sterpus. Sally is a tumpus. Sally is a lempus.\nQuestion: Sally is not a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a lempus.","Every lempus is a yumpus.","Sally is a yumpus.","Yumpuses are not sterpuses.","Sally is not a sterpus.\n\n","Assume Sally is a rompus.","Sally is a rompus or a grimpus or a jompus.","Everything that is a rompus or a grimpus or a jompus is a sterpus.","Sally is a sterpus.","This contradicts with Sally is not a sterpus.","Sally is not a rompus.\n\n"]}
{"input":"Context: Everything that is an impus, a lorpus, or a grimpus is a yumpus. Lempuses are impuses. Every gorpus is an impus. Lempuses are gorpuses, jompuses, and lorpuses. Jompuses are yumpuses. Sally is a dumpus. Sally is a lempus.\nQuestion: Sally is a gorpus or a zumpus or a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a lempus.","Lempuses are gorpuses, jompuses, and lorpuses.","Sally is a gorpus, a jompus, and a lorpus.","Sally is a lorpus.","Sally is a gorpus or a zumpus or a lorpus."]}
{"input":"Context: Polly is a shumpus. Everything that is a numpus, a yumpus, and a rompus is a jompus. Everything that is a numpus and a grimpus and a shumpus is a tumpus. Polly is a grimpus. Polly is a numpus. Everything that is a numpus and a yumpus and a rompus is a tumpus. Everything that is a jompus or a zumpus or a wumpus is a vumpus. Polly is a numpus. Polly is a vumpus. Polly is a yumpus. Polly is a rompus.\nQuestion: Polly is an impus or a lorpus or a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a rompus.","Polly is a yumpus.","Polly is a numpus.","Polly is a numpus and a yumpus and a rompus.","Everything that is a numpus, a yumpus, and a rompus is a jompus.","Polly is a jompus.","Polly is an impus or a lorpus or a jompus."]}
{"input":"Context: Everything that is a jompus or a vumpus or an impus is a lorpus. Impuses are shumpuses. Lempuses are yumpuses. Each zumpus is an impus. Everything that is a numpus, a gorpus, or a jompus is a shumpus. Everything that is a numpus or a gorpus or a jompus is a dumpus. Wren is an impus. Wren is a yumpus, a rompus, and a tumpus. Wren is not a shumpus, Wren is a lempus, and Wren is a zumpus.\nQuestion: Wren is not a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is not a shumpus and Wren is a lempus and Wren is a zumpus.","Wren is not a shumpus.\n\n","Assume Wren is a jompus.","Wren is a numpus, a gorpus, or a jompus.","Everything that is a numpus, a gorpus, or a jompus is a shumpus.","Wren is a shumpus.","This contradicts with Wren is not a shumpus.","Wren is not a jompus.\n\n"]}
{"input":"Context: Everything that is a dumpus or a brimpus or a wumpus is a gorpus and a lempus and a grimpus. Everything that is an impus, a dumpus, or a vumpus is a rompus. Everything that is a dumpus or a brimpus or a wumpus is a rompus. Gorpuses are sterpuses. Lempuses are vumpuses. Alex is a vumpus. Alex is a dumpus.\nQuestion: Alex is a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a dumpus.","Alex is a dumpus or a brimpus or a wumpus.","Everything that is a dumpus or a brimpus or a wumpus is a gorpus and a lempus and a grimpus.","Alex is a gorpus, a lempus, and a grimpus.","Alex is a grimpus."]}
{"input":"Context: Lorpuses are numpuses. Impuses are gorpuses. Impuses are jompuses. Every shumpus is a rompus. Everything that is a brimpus or a gorpus or a grimpus is a jompus. Sam is a jompus and a rompus and a brimpus. Sam is a lorpus and an impus and a shumpus.\nQuestion: Sam is a vumpus or a gorpus or a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a lorpus, an impus, and a shumpus.","Sam is an impus.","Impuses are gorpuses.","Sam is a gorpus.","Sam is a vumpus, a gorpus, or a tumpus."]}
{"input":"Context: Lempuses are zumpuses. Dumpuses are sterpuses. Each numpus is a lorpus. Wren is a lempus. Each gorpus is a tumpus. Everything that is a lempus, a rompus, and a jompus is a tumpus. Gorpuses are zumpuses, numpuses, and dumpuses. Wren is a jompus. Everything that is a rompus and a yumpus and a numpus is a tumpus. Wren is a rompus. Everything that is a rompus and a yumpus and a numpus is not a zumpus. Wren is a rompus. Wren is a yumpus. Wren is a sterpus. Wren is a numpus.\nQuestion: Wren is not a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a numpus.","Wren is a yumpus.","Wren is a rompus.","Wren is a rompus and a yumpus and a numpus.","Everything that is a rompus and a yumpus and a numpus is not a zumpus.","Wren is not a zumpus.\n\n","Assume Wren is a gorpus.","Gorpuses are zumpuses, numpuses, and dumpuses.","Wren is a zumpus, a numpus, and a dumpus.","Wren is a zumpus.","This contradicts with Wren is not a zumpus.","Wren is not a gorpus.\n\n"]}
{"input":"Context: Wumpuses are shumpuses. Each numpus is a sterpus. Each vumpus is a gorpus. Everything that is a wumpus, a grimpus, and a rompus is a sterpus. Polly is a yumpus. Polly is a numpus. Everything that is a wumpus and a grimpus and a rompus is an impus. Polly is a wumpus. Everything that is a wumpus, an impus, and a yumpus is a jompus. Polly is an impus. Polly is a wumpus and Polly is not a sterpus and Polly is a vumpus. Polly is a lempus, a lorpus, and a shumpus. Polly is a wumpus. Polly is a rompus.\nQuestion: Polly is not a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a wumpus and Polly is not a sterpus and Polly is a vumpus.","Polly is not a sterpus.","Polly is a rompus.\n\n","Assume Polly is a grimpus.","Polly is a wumpus.","Polly is a wumpus and a grimpus and a rompus.","Everything that is a wumpus, a grimpus, and a rompus is a sterpus.","Polly is a sterpus.","This contradicts with Polly is not a sterpus.","Polly is not a grimpus.\n\n"]}
{"input":"Context: Wumpuses are yumpuses. Brimpuses are sterpuses. Everything that is a rompus, a dumpus, or a vumpus is a jompus. Wumpuses are tumpuses and brimpuses and rompuses. Tumpuses are lempuses. Max is a dumpus. Max is a wumpus.\nQuestion: Max is a rompus, a shumpus, or a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a wumpus.","Wumpuses are tumpuses and brimpuses and rompuses.","Max is a tumpus, a brimpus, and a rompus.","Max is a rompus.","Max is a rompus or a shumpus or a zumpus."]}
{"input":"Context: Every lempus is a vumpus. Everything that is a sterpus, a rompus, or an impus is a gorpus and a lempus and a jompus. Gorpuses are zumpuses. Everything that is a rompus or a vumpus or a zumpus is a tumpus. Everything that is a sterpus, a rompus, or an impus is a brimpus. Max is a numpus. Max is a rompus.\nQuestion: Max is a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a rompus.","Max is a sterpus, a rompus, or an impus.","Everything that is a sterpus, a rompus, or an impus is a gorpus and a lempus and a jompus.","Max is a gorpus and a lempus and a jompus.","Max is a jompus."]}
{"input":"Context: Everything that is a zumpus or a tumpus or a numpus is a wumpus. Every shumpus is a sterpus. Every grimpus is a dumpus. Everything that is an impus, a tumpus, or a lorpus is a vumpus. Everything that is a zumpus, a tumpus, or a numpus is a grimpus and a yumpus and a shumpus. Sam is a vumpus. Sam is a tumpus.\nQuestion: Sam is a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a tumpus.","Sam is a zumpus or a tumpus or a numpus.","Everything that is a zumpus, a tumpus, or a numpus is a grimpus and a yumpus and a shumpus.","Sam is a grimpus, a yumpus, and a shumpus.","Sam is a yumpus."]}
{"input":"Context: Yumpuses are rompuses. Grimpuses are wumpuses. Every brimpus is a lempus. Numpuses are vumpuses. Stella is a yumpus. Vumpuses are rompuses. Vumpuses are gorpuses. Numpuses are shumpuses. Stella is a lempus, a gorpus, and a sterpus. Stella is a grimpus, Stella is not a rompus, and Stella is a brimpus.\nQuestion: Stella is not a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a grimpus and Stella is not a rompus and Stella is a brimpus.","Stella is not a rompus.\n\n","Assume Stella is a numpus.","Numpuses are vumpuses.","Stella is a vumpus.","Vumpuses are rompuses.","Stella is a rompus.","This contradicts with Stella is not a rompus.","Stella is not a numpus.\n\n"]}
{"input":"Context: Everything that is a gorpus or a wumpus or a lempus is a lorpus. Each dumpus is a jompus. Everything that is a yumpus, a wumpus, or a zumpus is a dumpus and a rompus and a sterpus. Everything that is a yumpus, a wumpus, or a zumpus is a lempus. Sterpuses are lempuses. Fae is a vumpus. Fae is a wumpus.\nQuestion: Fae is a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a wumpus.","Fae is a yumpus or a wumpus or a zumpus.","Everything that is a yumpus, a wumpus, or a zumpus is a dumpus and a rompus and a sterpus.","Fae is a dumpus and a rompus and a sterpus.","Fae is a rompus."]}
{"input":"Context: Vumpuses are zumpuses. Everything that is a sterpus and a shumpus and a grimpus is a zumpus. Each lorpus is a yumpus. Rex is a sterpus. Everything that is a sterpus, a shumpus, and a grimpus is an impus. Rex is a yumpus. Rex is a vumpus. Everything that is a yumpus, a sterpus, and a jompus is a wumpus. Each lempus is a gorpus. Rex is a jompus. Rex is a jompus, a tumpus, and a yumpus. Rex is a lorpus and Rex is not a zumpus and Rex is a lempus. Rex is a sterpus. Rex is a grimpus.\nQuestion: Rex is not a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a lorpus, Rex is not a zumpus, and Rex is a lempus.","Rex is not a zumpus.","Rex is a grimpus.\n\n","Assume Rex is a shumpus.","Rex is a sterpus.","Rex is a sterpus and a shumpus and a grimpus.","Everything that is a sterpus and a shumpus and a grimpus is a zumpus.","Rex is a zumpus.","This contradicts with Rex is not a zumpus.","Rex is not a shumpus.\n\n"]}
{"input":"Context: Every grimpus is a zumpus and a tumpus and a shumpus. Each zumpus is a wumpus. Everything that is a brimpus, a shumpus, or a lorpus is a rompus. Every grimpus is a rompus. Tumpuses are sterpuses. Rex is an impus. Rex is a grimpus.\nQuestion: Rex is a lempus, a shumpus, or a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a grimpus.","Every grimpus is a zumpus and a tumpus and a shumpus.","Rex is a zumpus, a tumpus, and a shumpus.","Rex is a shumpus.","Rex is a lempus or a shumpus or a yumpus."]}
{"input":"Context: Each lorpus is a sterpus. Vumpuses are numpuses. Wumpuses are tumpuses. Alex is a shumpus. Each rompus is a jompus. Every grimpus is a zumpus. Each shumpus is a brimpus. Every rompus is a grimpus, a wumpus, and a brimpus. Alex is a sterpus, a zumpus, and a gorpus. Alex is not a brimpus and Alex is a vumpus and Alex is a lorpus.\nQuestion: Alex is not a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is not a brimpus, Alex is a vumpus, and Alex is a lorpus.","Alex is not a brimpus.\n\n","Assume Alex is a rompus.","Every rompus is a grimpus, a wumpus, and a brimpus.","Alex is a grimpus and a wumpus and a brimpus.","Alex is a brimpus.","This contradicts with Alex is not a brimpus.","Alex is not a rompus.\n\n"]}
{"input":"Context: Everything that is a shumpus or a gorpus or a yumpus is a tumpus. Each lempus is an impus. Everything that is a lempus, a numpus, or a gorpus is a wumpus. Everything that is a lempus or a numpus or a gorpus is a tumpus. Zumpuses are vumpuses. Polly is a brimpus and a dumpus and a rompus. Polly is a gorpus, a zumpus, and a lempus.\nQuestion: Polly is a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a gorpus and a zumpus and a lempus.","Polly is a gorpus.","Polly is a lempus or a numpus or a gorpus.","Everything that is a lempus, a numpus, or a gorpus is a wumpus.","Polly is a wumpus."]}
{"input":"Context: Everything that is a numpus or a gorpus or a lempus is a yumpus. Tumpuses are numpuses. Tumpuses are vumpuses. Every sterpus is a brimpus. Grimpuses are lempuses. Stella is a wumpus, a dumpus, and a lorpus. Stella is a grimpus, a tumpus, and a sterpus.\nQuestion: Stella is a numpus or a grimpus or an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a grimpus and a tumpus and a sterpus.","Stella is a tumpus.","Tumpuses are numpuses.","Stella is a numpus.","Stella is a numpus or a grimpus or an impus."]}
{"input":"Context: Wren is a numpus. Everything that is a wumpus, a numpus, and a vumpus is an impus. Wren is a vumpus. Everything that is a yumpus or a rompus or a dumpus is a wumpus. Everything that is a numpus and a grimpus and a lorpus is a wumpus. Everything that is a numpus, a grimpus, and a lorpus is a rompus. Wren is a wumpus. Wren is a numpus. Wren is an impus. Wren is a grimpus. Wren is a lorpus.\nQuestion: Wren is a sterpus, a rompus, or a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a lorpus.","Wren is a grimpus.","Wren is a numpus.","Wren is a numpus, a grimpus, and a lorpus.","Everything that is a numpus, a grimpus, and a lorpus is a rompus.","Wren is a rompus.","Wren is a sterpus, a rompus, or a jompus."]}
{"input":"Context: Sam is a shumpus. Every dumpus is a lempus. Shumpuses are wumpuses. Everything that is a lempus, a tumpus, and a numpus is an impus. Everything that is a tumpus and a vumpus and a lorpus is a jompus. Zumpuses are brimpuses. Sam is a lempus. Everything that is a tumpus and a vumpus and a lorpus is a wumpus. Sam is a tumpus. Sam is a numpus. Sam is a numpus and a grimpus and a gorpus. Sam is not a wumpus, Sam is a dumpus, and Sam is a zumpus. Sam is a vumpus. Sam is a lorpus.\nQuestion: Sam is not a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is not a wumpus, Sam is a dumpus, and Sam is a zumpus.","Sam is not a wumpus.","Sam is a lorpus.","Sam is a vumpus.\n\n","Assume Sam is a tumpus.","Sam is a tumpus and a vumpus and a lorpus.","Everything that is a tumpus and a vumpus and a lorpus is a wumpus.","Sam is a wumpus.","This contradicts with Sam is not a wumpus.","Sam is not a tumpus.\n\n"]}
{"input":"Context: Each grimpus is a gorpus and a numpus and a vumpus. Every grimpus is a sterpus. Jompuses are yumpuses. Gorpuses are zumpuses. Vumpuses are shumpuses. Sterpuses are numpuses. Each lempus is a wumpus. Sam is a sterpus. Sam is a sterpus and a dumpus and a rompus. Sam is not a numpus and Sam is a lempus and Sam is a jompus.\nQuestion: Sam is not a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is not a numpus and Sam is a lempus and Sam is a jompus.","Sam is not a numpus.\n\n","Assume Sam is a grimpus.","Each grimpus is a gorpus and a numpus and a vumpus.","Sam is a gorpus, a numpus, and a vumpus.","Sam is a numpus.","This contradicts with Sam is not a numpus.","Sam is not a grimpus.\n\n"]}
{"input":"Context: Every impus is a numpus and a lempus and a dumpus. Impuses are vumpuses. Every gorpus is a wumpus. Max is a grimpus. Zumpuses are lorpuses. Every grimpus is a lempus. Numpuses are sterpuses. Every dumpus is a grimpus. Max is a shumpus, a grimpus, and a wumpus. Max is a gorpus and Max is a zumpus and Max is not a lempus.\nQuestion: Max is not an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a gorpus, Max is a zumpus, and Max is not a lempus.","Max is not a lempus.\n\n","Assume Max is an impus.","Every impus is a numpus and a lempus and a dumpus.","Max is a numpus, a lempus, and a dumpus.","Max is a lempus.","This contradicts with Max is not a lempus.","Max is not an impus.\n\n"]}
{"input":"Context: Each zumpus is a grimpus. Each numpus is an impus and a zumpus and a rompus. Everything that is an impus or a lempus or a vumpus is a grimpus. Rompuses are jompuses. Numpuses are yumpuses. Sally is a vumpus. Sally is a numpus.\nQuestion: Sally is an impus, a gorpus, or a sterpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a numpus.","Each numpus is an impus and a zumpus and a rompus.","Sally is an impus, a zumpus, and a rompus.","Sally is an impus.","Sally is an impus, a gorpus, or a sterpus."]}
{"input":"Context: Everything that is a yumpus or a zumpus or a grimpus is a brimpus. Impuses are gorpuses. Each jompus is a shumpus. Shumpuses are sterpuses. Every dumpus is not a sterpus. Sally is a shumpus. Everything that is a numpus or a zumpus or a lempus is a wumpus. Every dumpus is a gorpus. Everything that is a yumpus, a zumpus, or a grimpus is a sterpus. Sally is a gorpus, a vumpus, and a shumpus. Sally is an impus and a dumpus and a jompus.\nQuestion: Sally is not a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is an impus, a dumpus, and a jompus.","Sally is a dumpus.","Every dumpus is not a sterpus.","Sally is not a sterpus.\n\n","Assume Sally is a zumpus.","Sally is a yumpus, a zumpus, or a grimpus.","Everything that is a yumpus, a zumpus, or a grimpus is a sterpus.","Sally is a sterpus.","This contradicts with Sally is not a sterpus.","Sally is not a zumpus.\n\n"]}
{"input":"Context: Everything that is a jompus, a yumpus, or a dumpus is a numpus. Each gorpus is a wumpus. Grimpuses are shumpuses. Every gorpus is a grimpus, a jompus, and an impus. Each impus is a zumpus. Wren is a yumpus. Wren is a gorpus.\nQuestion: Wren is a brimpus, a jompus, or a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a gorpus.","Every gorpus is a grimpus, a jompus, and an impus.","Wren is a grimpus, a jompus, and an impus.","Wren is a jompus.","Wren is a brimpus, a jompus, or a rompus."]}
{"input":"Context: Everything that is a numpus and a sterpus and an impus is a rompus. Wren is a numpus. Wren is a gorpus. Every wumpus is a gorpus. Wren is a yumpus. Each vumpus is a shumpus. Everything that is a numpus, a sterpus, and an impus is a wumpus and a vumpus and a dumpus. Everything that is a numpus and a gorpus and a yumpus is a jompus. Wren is a numpus. Wren is a tumpus. Wren is a sterpus. Wren is an impus.\nQuestion: Wren is a dumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is an impus.","Wren is a sterpus.","Wren is a numpus.","Wren is a numpus, a sterpus, and an impus.","Everything that is a numpus, a sterpus, and an impus is a wumpus and a vumpus and a dumpus.","Wren is a wumpus and a vumpus and a dumpus.","Wren is a dumpus."]}
{"input":"Context: Dumpuses are lempuses. Sterpuses are jompuses, shumpuses, and dumpuses. Sterpuses are tumpuses. Jompuses are impuses. Everything that is a numpus, a shumpus, or a lorpus is a lempus. Rex is a zumpus. Rex is a sterpus.\nQuestion: Rex is a shumpus, a yumpus, or a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a sterpus.","Sterpuses are jompuses, shumpuses, and dumpuses.","Rex is a jompus, a shumpus, and a dumpus.","Rex is a shumpus.","Rex is a shumpus or a yumpus or a vumpus."]}
{"input":"Context: Alex is a wumpus. Alex is a lorpus. Shumpuses are tumpuses. Each sterpus is a wumpus. Everything that is a jompus, a vumpus, and an impus is a lorpus. Everything that is a wumpus and a jompus and a lorpus is a gorpus. Everything that is a jompus and a vumpus and an impus is a sterpus and a shumpus and a brimpus. Alex is a jompus. Alex is a jompus. Alex is a vumpus. Alex is a numpus. Alex is an impus.\nQuestion: Alex is a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is an impus.","Alex is a vumpus.","Alex is a jompus.","Alex is a jompus, a vumpus, and an impus.","Everything that is a jompus and a vumpus and an impus is a sterpus and a shumpus and a brimpus.","Alex is a sterpus, a shumpus, and a brimpus.","Alex is a brimpus."]}
{"input":"Context: Yumpuses are sterpuses. Everything that is a rompus, a grimpus, or a numpus is a yumpus, an impus, and a shumpus. Everything that is a rompus, a zumpus, or a lorpus is a tumpus. Everything that is a rompus or a grimpus or a numpus is a sterpus. Impuses are wumpuses. Rex is a lempus. Rex is a rompus.\nQuestion: Rex is a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a rompus.","Rex is a rompus, a grimpus, or a numpus.","Everything that is a rompus, a grimpus, or a numpus is a yumpus, an impus, and a shumpus.","Rex is a yumpus, an impus, and a shumpus.","Rex is a shumpus."]}
{"input":"Context: Everything that is a rompus or an impus or a zumpus is a tumpus. Everything that is a yumpus and a shumpus and a numpus is a brimpus. Sam is a dumpus. Sam is a yumpus. Everything that is a yumpus and a shumpus and a numpus is a rompus. Everything that is a zumpus, a yumpus, and a dumpus is an impus. Sam is a zumpus. Sam is a yumpus. Sam is an impus. Sam is a shumpus. Sam is a numpus.\nQuestion: Sam is a lempus, a sterpus, or a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a numpus.","Sam is a shumpus.","Sam is a yumpus.","Sam is a yumpus and a shumpus and a numpus.","Everything that is a yumpus and a shumpus and a numpus is a rompus.","Sam is a rompus.","Sam is a lempus, a sterpus, or a rompus."]}
{"input":"Context: Each zumpus is a wumpus. Rompuses are gorpuses. Every zumpus is a lempus. Everything that is a wumpus, a sterpus, or a tumpus is a yumpus. Every grimpus is a jompus. Sam is a gorpus, a tumpus, and an impus. Sam is a zumpus, a rompus, and a grimpus.\nQuestion: Sam is a wumpus, a zumpus, or a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a zumpus and a rompus and a grimpus.","Sam is a zumpus.","Each zumpus is a wumpus.","Sam is a wumpus.","Sam is a wumpus, a zumpus, or a rompus."]}
{"input":"Context: Wumpuses are dumpuses. Each vumpus is a wumpus and a lorpus and a rompus. Each lorpus is a gorpus. Wren is a dumpus. Each zumpus is a gorpus. Each dumpus is a rompus. Every numpus is a shumpus. Vumpuses are dumpuses. Wren is a shumpus and a dumpus and a yumpus. Wren is a zumpus and Wren is not a rompus and Wren is a numpus.\nQuestion: Wren is not a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a zumpus, Wren is not a rompus, and Wren is a numpus.","Wren is not a rompus.\n\n","Assume Wren is a vumpus.","Each vumpus is a wumpus and a lorpus and a rompus.","Wren is a wumpus and a lorpus and a rompus.","Wren is a rompus.","This contradicts with Wren is not a rompus.","Wren is not a vumpus.\n\n"]}
{"input":"Context: Each tumpus is a yumpus, a gorpus, and a lorpus. Tumpuses are zumpuses. Each lorpus is a grimpus. Each yumpus is a sterpus. Everything that is a zumpus or a gorpus or a numpus is a brimpus. Polly is a vumpus. Polly is a tumpus.\nQuestion: Polly is a yumpus or a lempus or a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a tumpus.","Each tumpus is a yumpus, a gorpus, and a lorpus.","Polly is a yumpus, a gorpus, and a lorpus.","Polly is a gorpus.","Polly is a yumpus or a lempus or a gorpus."]}
{"input":"Context: Everything that is a dumpus or a lempus or a zumpus is a lorpus. Brimpuses are grimpuses, dumpuses, and numpuses. Numpuses are lorpuses. Brimpuses are rompuses. Every grimpus is a zumpus. Rex is a zumpus. Rex is a brimpus.\nQuestion: Rex is a wumpus, a dumpus, or an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a brimpus.","Brimpuses are grimpuses, dumpuses, and numpuses.","Rex is a grimpus, a dumpus, and a numpus.","Rex is a dumpus.","Rex is a wumpus or a dumpus or an impus."]}
{"input":"Context: Yumpuses are lempuses. Wren is a grimpus. Wren is a shumpus. Everything that is a tumpus and a jompus and a lorpus is a brimpus. Each numpus is a dumpus. Wren is a tumpus. Everything that is a tumpus and a jompus and a lorpus is a yumpus and a numpus and an impus. Everything that is a grimpus and a tumpus and a shumpus is a lempus. Wren is a tumpus. Wren is a jompus. Wren is a wumpus. Wren is a lorpus.\nQuestion: Wren is an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a lorpus.","Wren is a jompus.","Wren is a tumpus.","Wren is a tumpus, a jompus, and a lorpus.","Everything that is a tumpus and a jompus and a lorpus is a yumpus and a numpus and an impus.","Wren is a yumpus, a numpus, and an impus.","Wren is an impus."]}
{"input":"Context: Gorpuses are rompuses. Everything that is a rompus and a grimpus and a jompus is a lempus. Polly is a rompus. Everything that is a grimpus and a yumpus and an impus is a numpus and a brimpus and a gorpus. Polly is a jompus. Everything that is a grimpus and a yumpus and an impus is a zumpus. Polly is a grimpus. Each numpus is a jompus. Polly is a vumpus. Polly is a grimpus. Polly is a yumpus. Polly is an impus.\nQuestion: Polly is a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is an impus.","Polly is a yumpus.","Polly is a grimpus.","Polly is a grimpus, a yumpus, and an impus.","Everything that is a grimpus and a yumpus and an impus is a numpus and a brimpus and a gorpus.","Polly is a numpus, a brimpus, and a gorpus.","Polly is a brimpus."]}
{"input":"Context: Everything that is a grimpus, a gorpus, or a yumpus is a vumpus. Every dumpus is a wumpus. Each tumpus is a jompus and a grimpus and a dumpus. Jompuses are lorpuses. Each tumpus is a brimpus. Max is a lempus. Max is a tumpus.\nQuestion: Max is a rompus or a grimpus or a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a tumpus.","Each tumpus is a jompus and a grimpus and a dumpus.","Max is a jompus and a grimpus and a dumpus.","Max is a grimpus.","Max is a rompus or a grimpus or a numpus."]}
{"input":"Context: Numpuses are wumpuses. Impuses are lorpuses. Everything that is a tumpus, a zumpus, or a lempus is a gorpus. Sally is a numpus. Everything that is a zumpus or a shumpus or a grimpus is a wumpus. Everything that is a zumpus, a shumpus, or a grimpus is a numpus. Vumpuses are lempuses. Sally is a numpus and a jompus and a lempus. Sally is not a wumpus and Sally is an impus and Sally is a vumpus.\nQuestion: Sally is not a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is not a wumpus and Sally is an impus and Sally is a vumpus.","Sally is not a wumpus.\n\n","Assume Sally is a zumpus.","Sally is a zumpus or a shumpus or a grimpus.","Everything that is a zumpus or a shumpus or a grimpus is a wumpus.","Sally is a wumpus.","This contradicts with Sally is not a wumpus.","Sally is not a zumpus.\n\n"]}
{"input":"Context: Everything that is a grimpus or a gorpus or a rompus is a lorpus. Every shumpus is an impus, a grimpus, and a wumpus. Every wumpus is a tumpus. Shumpuses are gorpuses. Impuses are numpuses. Fae is a lempus. Fae is a shumpus.\nQuestion: Fae is a grimpus, a zumpus, or a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a shumpus.","Every shumpus is an impus, a grimpus, and a wumpus.","Fae is an impus and a grimpus and a wumpus.","Fae is a grimpus.","Fae is a grimpus, a zumpus, or a vumpus."]}
{"input":"Context: Numpuses are grimpuses and jompuses and wumpuses. Wumpuses are impuses. Everything that is a vumpus, a jompus, or a dumpus is a lorpus. Each numpus is a lempus. Grimpuses are dumpuses. Fae is a lorpus. Fae is a numpus.\nQuestion: Fae is a jompus or a gorpus or a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a numpus.","Numpuses are grimpuses and jompuses and wumpuses.","Fae is a grimpus and a jompus and a wumpus.","Fae is a jompus.","Fae is a jompus, a gorpus, or a yumpus."]}
{"input":"Context: Everything that is a lorpus, a brimpus, or a jompus is a shumpus. Every wumpus is a vumpus and a sterpus and a brimpus. Everything that is a vumpus, a grimpus, or a brimpus is a lempus. Everything that is a lempus or a jompus or a lorpus is a dumpus. Vumpuses are rompuses. Every sterpus is a gorpus. Everything that is a vumpus, a grimpus, or a brimpus is a dumpus. Wumpuses are shumpuses. Polly is a rompus. Polly is a wumpus.\nQuestion: Polly is a lempus or an impus or a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a wumpus.","Every wumpus is a vumpus and a sterpus and a brimpus.","Polly is a vumpus and a sterpus and a brimpus.","Polly is a brimpus.","Polly is a vumpus, a grimpus, or a brimpus.","Everything that is a vumpus, a grimpus, or a brimpus is a lempus.","Polly is a lempus.","Polly is a lempus, an impus, or a yumpus."]}
{"input":"Context: Everything that is a zumpus or a vumpus or a wumpus is a gorpus. Everything that is a vumpus, a grimpus, or an impus is a dumpus. Everything that is a numpus or a shumpus or a yumpus is a zumpus. Everything that is a numpus, a shumpus, or a yumpus is a grimpus. Everything that is a vumpus or a grimpus or an impus is a brimpus and a numpus and a lorpus. Lorpuses are zumpuses. Every brimpus is a tumpus. Everything that is a numpus, a gorpus, or a rompus is a sterpus. Sam is a wumpus. Sam is a vumpus.\nQuestion: Sam is a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a vumpus.","Sam is a vumpus, a grimpus, or an impus.","Everything that is a vumpus or a grimpus or an impus is a brimpus and a numpus and a lorpus.","Sam is a brimpus, a numpus, and a lorpus.","Sam is a numpus.","Sam is a numpus or a shumpus or a yumpus.","Everything that is a numpus, a shumpus, or a yumpus is a grimpus.","Sam is a grimpus."]}
{"input":"Context: Every sterpus is a rompus. Each jompus is a dumpus. Everything that is a tumpus or a zumpus or a yumpus is an impus. Jompuses are lempuses. Everything that is a zumpus, a lempus, or a shumpus is an impus. Everything that is a tumpus, a zumpus, or a yumpus is a numpus and a jompus and a sterpus. Numpuses are lempuses. Every wumpus is a zumpus. Each wumpus is a vumpus. Alex is a vumpus. Alex is a wumpus.\nQuestion: Alex is a dumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a wumpus.","Every wumpus is a zumpus.","Alex is a zumpus.","Alex is a tumpus or a zumpus or a yumpus.","Everything that is a tumpus, a zumpus, or a yumpus is a numpus and a jompus and a sterpus.","Alex is a numpus and a jompus and a sterpus.","Alex is a jompus.","Each jompus is a dumpus.","Alex is a dumpus."]}
{"input":"Context: Grimpuses are shumpuses. Everything that is a shumpus or a wumpus or a sterpus is a tumpus. Everything that is a shumpus, a wumpus, or a sterpus is a numpus and a yumpus and a rompus. Grimpuses are tumpuses. Yumpuses are lorpuses. Everything that is a tumpus or a rompus or a jompus is a zumpus. Everything that is an impus, a shumpus, or a zumpus is a gorpus. Numpuses are dumpuses. Rex is a jompus. Rex is a grimpus.\nQuestion: Rex is a yumpus or a rompus or a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a grimpus.","Grimpuses are shumpuses.","Rex is a shumpus.","Rex is a shumpus, a wumpus, or a sterpus.","Everything that is a shumpus, a wumpus, or a sterpus is a numpus and a yumpus and a rompus.","Rex is a numpus, a yumpus, and a rompus.","Rex is a rompus.","Rex is a yumpus, a rompus, or a vumpus."]}
{"input":"Context: Each grimpus is a brimpus. Grimpuses are sterpuses and impuses and gorpuses. Every tumpus is a dumpus. Jompuses are brimpuses. Sterpuses are tumpuses and jompuses and rompuses. Sterpuses are lempuses. Every gorpus is a lempus. Everything that is a rompus or a zumpus or a wumpus is a dumpus. Every impus is a yumpus. Alex is a dumpus. Alex is a grimpus.\nQuestion: Alex is a numpus, a lorpus, or a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a grimpus.","Grimpuses are sterpuses and impuses and gorpuses.","Alex is a sterpus, an impus, and a gorpus.","Alex is a sterpus.","Sterpuses are tumpuses and jompuses and rompuses.","Alex is a tumpus and a jompus and a rompus.","Alex is a rompus.","Alex is a numpus, a lorpus, or a rompus."]}
{"input":"Context: Dumpuses are vumpuses. Each jompus is a dumpus and a numpus and a shumpus. Everything that is a tumpus, a zumpus, or a grimpus is an impus. Dumpuses are rompuses. Everything that is a tumpus, a gorpus, or a lempus is an impus. Lorpuses are wumpuses. Everything that is a tumpus or a zumpus or a grimpus is a jompus and a dumpus and a lorpus. Every shumpus is a rompus. Each jompus is a gorpus. Sam is a lempus. Sam is a tumpus.\nQuestion: Sam is a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a tumpus.","Sam is a tumpus or a zumpus or a grimpus.","Everything that is a tumpus or a zumpus or a grimpus is a jompus and a dumpus and a lorpus.","Sam is a jompus, a dumpus, and a lorpus.","Sam is a jompus.","Each jompus is a dumpus and a numpus and a shumpus.","Sam is a dumpus and a numpus and a shumpus.","Sam is a numpus."]}
{"input":"Context: Jompuses are gorpuses. Every numpus is a vumpus. Dumpuses are sterpuses. Every yumpus is a brimpus. Lempuses are gorpuses. Everything that is an impus or a zumpus or a shumpus is a gorpus. Every numpus is a rompus and a zumpus and a lempus. Dumpuses are yumpuses and jompuses and numpuses. Every rompus is a shumpus. Stella is a tumpus. Stella is a dumpus.\nQuestion: Stella is a lorpus, a zumpus, or a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a dumpus.","Dumpuses are yumpuses and jompuses and numpuses.","Stella is a yumpus and a jompus and a numpus.","Stella is a numpus.","Every numpus is a rompus and a zumpus and a lempus.","Stella is a rompus, a zumpus, and a lempus.","Stella is a zumpus.","Stella is a lorpus, a zumpus, or a wumpus."]}
{"input":"Context: Zumpuses are lempuses. Everything that is a tumpus or a rompus or a lorpus is an impus. Everything that is a rompus, a grimpus, or a sterpus is a tumpus. Gorpuses are impuses. Vumpuses are shumpuses. Each zumpus is a dumpus and a vumpus and a numpus. Dumpuses are impuses. Every numpus is a yumpus. Everything that is a rompus or a grimpus or a sterpus is a zumpus. Polly is a yumpus and a lorpus and a shumpus. Polly is a gorpus and a vumpus and a rompus.\nQuestion: Polly is a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a gorpus, a vumpus, and a rompus.","Polly is a rompus.","Polly is a rompus, a grimpus, or a sterpus.","Everything that is a rompus or a grimpus or a sterpus is a zumpus.","Polly is a zumpus.","Each zumpus is a dumpus and a vumpus and a numpus.","Polly is a dumpus and a vumpus and a numpus.","Polly is a vumpus."]}
{"input":"Context: Every wumpus is a yumpus. Lempuses are gorpuses. Each grimpus is a lempus. Everything that is a vumpus or a dumpus or a lorpus is a brimpus. Each grimpus is a shumpus. Everything that is a vumpus or a dumpus or a lorpus is a grimpus, a wumpus, and a sterpus. Lempuses are numpuses. Everything that is a vumpus, a brimpus, or a numpus is a tumpus. Sterpuses are shumpuses. Max is a tumpus. Max is a vumpus.\nQuestion: Max is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a vumpus.","Max is a vumpus, a dumpus, or a lorpus.","Everything that is a vumpus or a dumpus or a lorpus is a grimpus, a wumpus, and a sterpus.","Max is a grimpus, a wumpus, and a sterpus.","Max is a grimpus.","Each grimpus is a lempus.","Max is a lempus.","Lempuses are gorpuses.","Max is a gorpus."]}
{"input":"Context: Everything that is a rompus and a zumpus and a tumpus is a yumpus. Polly is a dumpus. Polly is a rompus. Everything that is a rompus and a zumpus and a tumpus is an impus. Yumpuses are shumpuses. Everything that is a rompus and a numpus and a dumpus is a lorpus. Every yumpus is a vumpus and a grimpus and a brimpus. Grimpuses are shumpuses. Polly is a numpus. Each vumpus is a lorpus. Everything that is a lempus, a brimpus, or an impus is a dumpus. Polly is a gorpus. Polly is a rompus. Polly is a zumpus. Polly is a tumpus.\nQuestion: Polly is a brimpus, a grimpus, or a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a tumpus.","Polly is a zumpus.","Polly is a rompus.","Polly is a rompus, a zumpus, and a tumpus.","Everything that is a rompus and a zumpus and a tumpus is a yumpus.","Polly is a yumpus.","Every yumpus is a vumpus and a grimpus and a brimpus.","Polly is a vumpus and a grimpus and a brimpus.","Polly is a brimpus.","Polly is a brimpus or a grimpus or a jompus."]}
{"input":"Context: Each shumpus is a gorpus. Each rompus is a jompus. Every lorpus is a numpus. Stella is a vumpus. Every shumpus is a grimpus, a zumpus, and a rompus. Wumpuses are yumpuses. Grimpuses are brimpuses. Vumpuses are sterpuses. Each zumpus is a numpus. Each lorpus is a vumpus. Every zumpus is a sterpus, a lorpus, and a shumpus. Stella is an impus, a brimpus, and a yumpus. Stella is a lorpus, Stella is not a sterpus, and Stella is a wumpus.\nQuestion: Stella is not a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a lorpus, Stella is not a sterpus, and Stella is a wumpus.","Stella is not a sterpus.\n\n","Assume Stella is a shumpus.","Every shumpus is a grimpus, a zumpus, and a rompus.","Stella is a grimpus, a zumpus, and a rompus.","Stella is a zumpus.","Every zumpus is a sterpus, a lorpus, and a shumpus.","Stella is a sterpus, a lorpus, and a shumpus.","Stella is a sterpus.","This contradicts with Stella is not a sterpus.","Stella is not a shumpus.\n\n"]}
{"input":"Context: Every lempus is a brimpus. Tumpuses are wumpuses. Everything that is a gorpus, a dumpus, or a grimpus is a lorpus. Every impus is a grimpus, a tumpus, and a yumpus. Lempuses are impuses. Each yumpus is a shumpus. Every impus is a lorpus. Everything that is a jompus, a grimpus, or a numpus is a lorpus. Everything that is a gorpus, a dumpus, or a grimpus is a vumpus. Stella is a numpus. Stella is a lempus.\nQuestion: Stella is a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a lempus.","Lempuses are impuses.","Stella is an impus.","Every impus is a grimpus, a tumpus, and a yumpus.","Stella is a grimpus, a tumpus, and a yumpus.","Stella is a grimpus.","Stella is a gorpus or a dumpus or a grimpus.","Everything that is a gorpus, a dumpus, or a grimpus is a vumpus.","Stella is a vumpus."]}
{"input":"Context: Sam is a lempus. Everything that is a zumpus, a shumpus, and a dumpus is a numpus, a sterpus, and a jompus. Sam is a zumpus. Everything that is a zumpus, a shumpus, and a dumpus is a vumpus. Sterpuses are lempuses. Each numpus is a gorpus. Everything that is a lempus, a zumpus, and an impus is a grimpus. Sam is an impus. Each wumpus is a shumpus. Every yumpus is a lempus. Each jompus is a vumpus. Sterpuses are brimpuses. Tumpuses are dumpuses. Each yumpus is a zumpus. Sam is a lempus. Sam is a yumpus. Sam is a wumpus. Sam is a tumpus.\nQuestion: Sam is a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a tumpus.","Tumpuses are dumpuses.","Sam is a dumpus.","Sam is a wumpus.","Each wumpus is a shumpus.","Sam is a shumpus.","Sam is a yumpus.","Each yumpus is a zumpus.","Sam is a zumpus.","Sam is a zumpus, a shumpus, and a dumpus.","Everything that is a zumpus, a shumpus, and a dumpus is a numpus, a sterpus, and a jompus.","Sam is a numpus and a sterpus and a jompus.","Sam is a sterpus.","Sterpuses are brimpuses.","Sam is a brimpus."]}
{"input":"Context: Tumpuses are zumpuses. Grimpuses are lempuses. Each gorpus is a jompus. Everything that is an impus or a sterpus or a rompus is a grimpus, a wumpus, and a tumpus. Everything that is an impus, a sterpus, or a rompus is a numpus. Everything that is a rompus or a lempus or a jompus is a vumpus. Each wumpus is a numpus. Every tumpus is a lempus. Every shumpus is a brimpus. Fae is a brimpus, a jompus, and a lorpus. Fae is a rompus, a gorpus, and a shumpus.\nQuestion: Fae is a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a rompus, a gorpus, and a shumpus.","Fae is a rompus.","Fae is an impus, a sterpus, or a rompus.","Everything that is an impus or a sterpus or a rompus is a grimpus, a wumpus, and a tumpus.","Fae is a grimpus, a wumpus, and a tumpus.","Fae is a tumpus.","Tumpuses are zumpuses.","Fae is a zumpus."]}
{"input":"Context: Every brimpus is a dumpus. Lempuses are grimpuses. Everything that is a shumpus or a zumpus or a brimpus is a numpus. Everything that is a wumpus or a brimpus or a grimpus is a lorpus. Every tumpus is a jompus, a lempus, and a brimpus. Jompuses are rompuses. Everything that is a shumpus or a zumpus or a brimpus is a jompus and a tumpus and a gorpus. Tumpuses are dumpuses. Every gorpus is a yumpus. Fae is a numpus. Fae is a brimpus.\nQuestion: Fae is a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a brimpus.","Fae is a shumpus, a zumpus, or a brimpus.","Everything that is a shumpus or a zumpus or a brimpus is a jompus and a tumpus and a gorpus.","Fae is a jompus, a tumpus, and a gorpus.","Fae is a tumpus.","Every tumpus is a jompus, a lempus, and a brimpus.","Fae is a jompus and a lempus and a brimpus.","Fae is a jompus."]}
{"input":"Context: Every shumpus is a sterpus. Vumpuses are tumpuses. Each dumpus is a numpus. Each grimpus is a tumpus. Everything that is a gorpus, a lorpus, or a sterpus is a wumpus. Everything that is a gorpus, a rompus, or a lempus is a vumpus. Everything that is a gorpus or a rompus or a lempus is a lorpus. Every shumpus is a gorpus. Each vumpus is a dumpus, a grimpus, and a jompus. Max is a yumpus. Max is a shumpus.\nQuestion: Max is a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a shumpus.","Every shumpus is a gorpus.","Max is a gorpus.","Max is a gorpus, a rompus, or a lempus.","Everything that is a gorpus, a rompus, or a lempus is a vumpus.","Max is a vumpus.","Each vumpus is a dumpus, a grimpus, and a jompus.","Max is a dumpus, a grimpus, and a jompus.","Max is a jompus."]}
{"input":"Context: Everything that is a numpus, a zumpus, or a dumpus is a grimpus. Yumpuses are rompuses. Sterpuses are zumpuses. Every tumpus is a shumpus. Lorpuses are yumpuses, numpuses, and brimpuses. Every vumpus is an impus. Lorpuses are dumpuses. Brimpuses are wumpuses. Sterpuses are lorpuses. Sam is a shumpus, a lempus, and a grimpus. Sam is a tumpus, a sterpus, and a vumpus.\nQuestion: Sam is a jompus, a tumpus, or a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a tumpus, a sterpus, and a vumpus.","Sam is a sterpus.","Sterpuses are lorpuses.","Sam is a lorpus.","Lorpuses are yumpuses, numpuses, and brimpuses.","Sam is a yumpus and a numpus and a brimpus.","Sam is a numpus.","Sam is a jompus or a tumpus or a numpus."]}
{"input":"Context: Each grimpus is a lempus. Gorpuses are vumpuses. Everything that is a shumpus, a rompus, or a numpus is a dumpus, a gorpus, and a grimpus. Zumpuses are numpuses and impuses and sterpuses. Everything that is a brimpus, a numpus, or a yumpus is a vumpus. Zumpuses are yumpuses. Impuses are tumpuses. Each sterpus is a brimpus. Everything that is a shumpus or a rompus or a numpus is a yumpus. Sam is a yumpus. Sam is a zumpus.\nQuestion: Sam is a dumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a zumpus.","Zumpuses are numpuses and impuses and sterpuses.","Sam is a numpus and an impus and a sterpus.","Sam is a numpus.","Sam is a shumpus, a rompus, or a numpus.","Everything that is a shumpus, a rompus, or a numpus is a dumpus, a gorpus, and a grimpus.","Sam is a dumpus, a gorpus, and a grimpus.","Sam is a dumpus."]}
{"input":"Context: Everything that is a jompus or a gorpus or a numpus is a vumpus. Everything that is a jompus or a gorpus or a numpus is a sterpus and a dumpus and a yumpus. Every sterpus is a zumpus. Everything that is an impus, a yumpus, or a brimpus is a tumpus. Every dumpus is a tumpus. Each sterpus is a gorpus. Every sterpus is a vumpus. Everything that is a gorpus or a tumpus or a zumpus is a shumpus. Sally is a brimpus. Sally is a sterpus.\nQuestion: Sally is a dumpus or a rompus or a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a sterpus.","Each sterpus is a gorpus.","Sally is a gorpus.","Sally is a jompus or a gorpus or a numpus.","Everything that is a jompus or a gorpus or a numpus is a sterpus and a dumpus and a yumpus.","Sally is a sterpus, a dumpus, and a yumpus.","Sally is a yumpus.","Sally is a dumpus, a rompus, or a yumpus."]}
{"input":"Context: Brimpuses are wumpuses. Every tumpus is a numpus. Everything that is a shumpus, a lorpus, and a wumpus is a gorpus. Max is a shumpus. Everything that is a shumpus and a lorpus and a wumpus is a yumpus. Each gorpus is a yumpus. Max is a grimpus. Sterpuses are yumpuses. Each gorpus is a tumpus, a vumpus, and a rompus. Max is a yumpus. Sterpuses are shumpuses. Everything that is a grimpus and a shumpus and a yumpus is a numpus. Brimpuses are lorpuses. Rompuses are jompuses. Max is an impus. Max is a sterpus. Max is a brimpus. Max is a brimpus.\nQuestion: Max is a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a brimpus.","Brimpuses are wumpuses.","Max is a wumpus.","Max is a brimpus.","Brimpuses are lorpuses.","Max is a lorpus.","Max is a sterpus.","Sterpuses are shumpuses.","Max is a shumpus.","Max is a shumpus and a lorpus and a wumpus.","Everything that is a shumpus, a lorpus, and a wumpus is a gorpus.","Max is a gorpus.","Each gorpus is a tumpus, a vumpus, and a rompus.","Max is a tumpus, a vumpus, and a rompus.","Max is a vumpus."]}
{"input":"Context: Everything that is a vumpus or an impus or a rompus is a tumpus. Everything that is a dumpus, a shumpus, or a wumpus is a tumpus. Sally is a rompus. Each brimpus is a lorpus. Everything that is a sterpus, a zumpus, or an impus is a shumpus. Everything that is a lorpus or a shumpus or a grimpus is a vumpus. Every rompus is a numpus. Yumpuses are vumpuses. Everything that is a dumpus or a shumpus or a wumpus is a numpus. Everything that is a sterpus, a zumpus, or an impus is a gorpus. Sally is a vumpus, a lempus, and a rompus. Sally is a yumpus and Sally is a brimpus and Sally is not a numpus.\nQuestion: Sally is not an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a yumpus and Sally is a brimpus and Sally is not a numpus.","Sally is not a numpus.\n\n","Assume Sally is an impus.","Sally is a sterpus or a zumpus or an impus.","Everything that is a sterpus, a zumpus, or an impus is a shumpus.","Sally is a shumpus.","Sally is a dumpus or a shumpus or a wumpus.","Everything that is a dumpus or a shumpus or a wumpus is a numpus.","Sally is a numpus.","This contradicts with Sally is not a numpus.","Sally is not an impus.\n\n"]}
{"input":"Context: Everything that is a tumpus or a grimpus or a rompus is a jompus. Grimpuses are zumpuses. Shumpuses are lorpuses. Every yumpus is a jompus. Everything that is a rompus, a brimpus, or a numpus is a dumpus. Everything that is a tumpus, a grimpus, or a rompus is a yumpus, a sterpus, and a shumpus. Every sterpus is a lorpus. Every vumpus is a brimpus. Every sterpus is a grimpus and a yumpus and a vumpus. Fae is an impus. Fae is a rompus.\nQuestion: Fae is a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a rompus.","Fae is a tumpus, a grimpus, or a rompus.","Everything that is a tumpus, a grimpus, or a rompus is a yumpus, a sterpus, and a shumpus.","Fae is a yumpus and a sterpus and a shumpus.","Fae is a sterpus.","Every sterpus is a grimpus and a yumpus and a vumpus.","Fae is a grimpus, a yumpus, and a vumpus.","Fae is a yumpus."]}
{"input":"Context: Each rompus is a shumpus and a brimpus and a lorpus. Each jompus is a sterpus. Everything that is a lorpus, a lempus, or a tumpus is a numpus. Every shumpus is a lempus. Brimpuses are yumpuses. Wumpuses are dumpuses. Rompuses are vumpuses. Each jompus is a wumpus, an impus, and a rompus. Impuses are vumpuses. Sam is a vumpus. Sam is a jompus.\nQuestion: Sam is a lorpus, a shumpus, or a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a jompus.","Each jompus is a wumpus, an impus, and a rompus.","Sam is a wumpus, an impus, and a rompus.","Sam is a rompus.","Each rompus is a shumpus and a brimpus and a lorpus.","Sam is a shumpus, a brimpus, and a lorpus.","Sam is a lorpus.","Sam is a lorpus, a shumpus, or a zumpus."]}
{"input":"Context: Everything that is a wumpus or a numpus or a jompus is a brimpus. Gorpuses are shumpuses. Zumpuses are vumpuses. Everything that is a numpus, a grimpus, or a sterpus is a lorpus, a zumpus, and a lempus. Lorpuses are gorpuses, impuses, and lempuses. Lorpuses are rompuses. Every lempus is a vumpus. Everything that is a numpus, a grimpus, or a sterpus is a jompus. Each lempus is a jompus. Max is a shumpus. Max is a numpus.\nQuestion: Max is an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a numpus.","Max is a numpus, a grimpus, or a sterpus.","Everything that is a numpus, a grimpus, or a sterpus is a lorpus, a zumpus, and a lempus.","Max is a lorpus and a zumpus and a lempus.","Max is a lorpus.","Lorpuses are gorpuses, impuses, and lempuses.","Max is a gorpus and an impus and a lempus.","Max is an impus."]}
{"input":"Context: Yumpuses are impuses. Tumpuses are lorpuses. Everything that is a rompus or a lorpus or a numpus is a vumpus. Every tumpus is a jompus, a sterpus, and a yumpus. Sterpuses are vumpuses. Dumpuses are zumpuses. Sterpuses are rompuses, dumpuses, and shumpuses. Shumpuses are lorpuses. Jompuses are lorpuses. Max is a lorpus. Max is a tumpus.\nQuestion: Max is a rompus, a yumpus, or a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a tumpus.","Every tumpus is a jompus, a sterpus, and a yumpus.","Max is a jompus, a sterpus, and a yumpus.","Max is a sterpus.","Sterpuses are rompuses, dumpuses, and shumpuses.","Max is a rompus, a dumpus, and a shumpus.","Max is a rompus.","Max is a rompus or a yumpus or a wumpus."]}
{"input":"Context: Every sterpus is a yumpus. Each wumpus is a shumpus. Numpuses are lempuses. Tumpuses are impuses. Each shumpus is a jompus. Alex is a yumpus. Every brimpus is an impus. Alex is a shumpus. Brimpuses are jompuses. Everything that is a wumpus, a gorpus, and a zumpus is a rompus. Everything that is a wumpus and a gorpus and a zumpus is a brimpus, a tumpus, and a numpus. Alex is a wumpus. Everything that is a yumpus and a wumpus and a shumpus is a lorpus. Alex is not a jompus, Alex is a wumpus, and Alex is a sterpus. Alex is an impus and a yumpus and a shumpus. Alex is a wumpus. Alex is a gorpus.\nQuestion: Alex is not a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is not a jompus and Alex is a wumpus and Alex is a sterpus.","Alex is not a jompus.\n\n","Assume Alex is a zumpus.","Alex is a gorpus.","Alex is a wumpus.","Alex is a wumpus, a gorpus, and a zumpus.","Everything that is a wumpus and a gorpus and a zumpus is a brimpus, a tumpus, and a numpus.","Alex is a brimpus, a tumpus, and a numpus.","Alex is a brimpus.","Brimpuses are jompuses.","Alex is a jompus.","This contradicts with Alex is not a jompus.","Alex is not a zumpus.\n\n"]}
{"input":"Context: Every rompus is a shumpus. Everything that is a shumpus, a tumpus, and a lempus is a jompus. Sally is a shumpus. Yumpuses are tumpuses. Sally is a lempus. Everything that is a tumpus, a grimpus, and a zumpus is a numpus. Tumpuses are dumpuses. Yumpuses are shumpuses. Sally is a tumpus. Wumpuses are zumpuses. Everything that is a tumpus and a grimpus and a zumpus is a rompus. Yumpuses are jompuses. Sterpuses are grimpuses. Rompuses are yumpuses, tumpuses, and impuses. Sally is a yumpus. Sally is a sterpus. Sally is a lorpus. Sally is a wumpus.\nQuestion: Sally is an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a wumpus.","Wumpuses are zumpuses.","Sally is a zumpus.","Sally is a sterpus.","Sterpuses are grimpuses.","Sally is a grimpus.","Sally is a yumpus.","Yumpuses are tumpuses.","Sally is a tumpus.","Sally is a tumpus, a grimpus, and a zumpus.","Everything that is a tumpus and a grimpus and a zumpus is a rompus.","Sally is a rompus.","Rompuses are yumpuses, tumpuses, and impuses.","Sally is a yumpus, a tumpus, and an impus.","Sally is an impus."]}
{"input":"Context: Alex is a gorpus. Each shumpus is a rompus. Everything that is a yumpus, a jompus, and a tumpus is a gorpus. Each sterpus is a brimpus. Alex is a dumpus. Everything that is a gorpus and a yumpus and a dumpus is a grimpus. Each shumpus is a zumpus. Everything that is a yumpus and a jompus and a tumpus is a numpus. Alex is a yumpus. Impuses are gorpuses. Every numpus is a lempus. Each numpus is a shumpus, a sterpus, and an impus. Alex is a yumpus. Alex is a grimpus. Alex is a jompus. Alex is a tumpus.\nQuestion: Alex is a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a tumpus.","Alex is a jompus.","Alex is a yumpus.","Alex is a yumpus, a jompus, and a tumpus.","Everything that is a yumpus and a jompus and a tumpus is a numpus.","Alex is a numpus.","Each numpus is a shumpus, a sterpus, and an impus.","Alex is a shumpus and a sterpus and an impus.","Alex is a shumpus.","Each shumpus is a rompus.","Alex is a rompus."]}
{"input":"Context: Wumpuses are lorpuses. Sterpuses are shumpuses. Everything that is a tumpus or a shumpus or a lorpus is a rompus. Everything that is a brimpus, a yumpus, or a shumpus is a zumpus, a wumpus, and an impus. Sterpuses are dumpuses. Each zumpus is a dumpus. Gorpuses are sterpuses. Each gorpus is a jompus. Everything that is a brimpus or a yumpus or a shumpus is a jompus. Sally is a jompus. Sally is a gorpus.\nQuestion: Sally is an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a gorpus.","Gorpuses are sterpuses.","Sally is a sterpus.","Sterpuses are shumpuses.","Sally is a shumpus.","Sally is a brimpus, a yumpus, or a shumpus.","Everything that is a brimpus, a yumpus, or a shumpus is a zumpus, a wumpus, and an impus.","Sally is a zumpus and a wumpus and an impus.","Sally is an impus."]}
{"input":"Context: Everything that is a jompus or a brimpus or a yumpus is an impus. Vumpuses are yumpuses. Each yumpus is a gorpus. Everything that is a jompus or a brimpus or a yumpus is a dumpus. Everything that is a yumpus or a gorpus or a tumpus is a wumpus. Everything that is a rompus or an impus or a wumpus is a grimpus. Every impus is a tumpus. Vumpuses are grimpuses. Polly is a lorpus and a grimpus and a sterpus. Polly is an impus, a yumpus, and a vumpus.\nQuestion: Polly is an impus or a zumpus or a lempus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is an impus and a yumpus and a vumpus.","Polly is a vumpus.","Vumpuses are yumpuses.","Polly is a yumpus.","Polly is a jompus, a brimpus, or a yumpus.","Everything that is a jompus or a brimpus or a yumpus is an impus.","Polly is an impus.","Polly is an impus, a zumpus, or a lempus."]}
{"input":"Context: Everything that is a grimpus or a gorpus or a lempus is a sterpus. Everything that is a gorpus or a rompus or a vumpus is a numpus. Each gorpus is a grimpus. Every impus is a zumpus and a gorpus and a shumpus. Wumpuses are gorpuses. Every wumpus is a lempus. Shumpuses are brimpuses. Impuses are lempuses. Everything that is a gorpus, a rompus, or a vumpus is an impus. Stella is a yumpus. Stella is a wumpus.\nQuestion: Stella is a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a wumpus.","Wumpuses are gorpuses.","Stella is a gorpus.","Stella is a gorpus or a rompus or a vumpus.","Everything that is a gorpus, a rompus, or a vumpus is an impus.","Stella is an impus.","Every impus is a zumpus and a gorpus and a shumpus.","Stella is a zumpus and a gorpus and a shumpus.","Stella is a zumpus."]}
{"input":"Context: Lempuses are numpuses. Each jompus is a sterpus. Everything that is an impus or a lorpus or a zumpus is a numpus. Yumpuses are rompuses. Everything that is a lorpus, a dumpus, or a vumpus is a rompus. Each tumpus is a zumpus. Everything that is a lorpus, a dumpus, or a vumpus is a tumpus and a lempus and a brimpus. Each lempus is a yumpus, a gorpus, and a jompus. Brimpuses are rompuses. Max is a sterpus. Max is a lorpus.\nQuestion: Max is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a lorpus.","Max is a lorpus, a dumpus, or a vumpus.","Everything that is a lorpus, a dumpus, or a vumpus is a tumpus and a lempus and a brimpus.","Max is a tumpus and a lempus and a brimpus.","Max is a lempus.","Each lempus is a yumpus, a gorpus, and a jompus.","Max is a yumpus and a gorpus and a jompus.","Max is a gorpus."]}
{"input":"Context: Each lorpus is a wumpus. Each sterpus is a vumpus, a lorpus, and an impus. Every grimpus is a wumpus. Each lempus is a dumpus. Each sterpus is a jompus. Everything that is a rompus or a brimpus or a yumpus is a numpus. Everything that is a shumpus or a brimpus or a zumpus is a dumpus. Everything that is a rompus or a brimpus or a yumpus is a sterpus. Vumpuses are gorpuses. Wren is a wumpus, a shumpus, and a zumpus. Wren is a brimpus, a grimpus, and a lempus.\nQuestion: Wren is an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a brimpus, a grimpus, and a lempus.","Wren is a brimpus.","Wren is a rompus or a brimpus or a yumpus.","Everything that is a rompus or a brimpus or a yumpus is a sterpus.","Wren is a sterpus.","Each sterpus is a vumpus, a lorpus, and an impus.","Wren is a vumpus, a lorpus, and an impus.","Wren is an impus."]}
{"input":"Context: Grimpuses are gorpuses. Zumpuses are sterpuses. Tumpuses are lorpuses. Everything that is a wumpus, a numpus, and a lorpus is a grimpus and an impus and a zumpus. Each zumpus is a wumpus. Each impus is a shumpus. Every grimpus is a vumpus. Lempuses are numpuses. Rex is a wumpus. Everything that is a wumpus, a numpus, and a lorpus is a dumpus. Rex is a brimpus. Rex is a rompus. Each zumpus is a rompus. Everything that is a wumpus, a rompus, and a brimpus is a jompus. Rex is a zumpus. Rex is a jompus. Rex is a lempus. Rex is a tumpus.\nQuestion: Rex is a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a tumpus.","Tumpuses are lorpuses.","Rex is a lorpus.","Rex is a lempus.","Lempuses are numpuses.","Rex is a numpus.","Rex is a zumpus.","Each zumpus is a wumpus.","Rex is a wumpus.","Rex is a wumpus, a numpus, and a lorpus.","Everything that is a wumpus, a numpus, and a lorpus is a grimpus and an impus and a zumpus.","Rex is a grimpus and an impus and a zumpus.","Rex is a grimpus.","Every grimpus is a vumpus.","Rex is a vumpus."]}
{"input":"Context: Numpuses are jompuses. Wren is a sterpus. Sterpuses are brimpuses. Everything that is a grimpus, a tumpus, or a sterpus is a jompus. Every zumpus is a sterpus. Numpuses are wumpuses, impuses, and tumpuses. Each wumpus is a vumpus. Yumpuses are vumpuses. Everything that is a shumpus, a dumpus, or a tumpus is a brimpus. Impuses are rompuses. Everything that is a shumpus or a dumpus or a tumpus is a sterpus. Wren is a gorpus, a rompus, and a jompus. Wren is not a brimpus and Wren is a zumpus and Wren is a yumpus.\nQuestion: Wren is not a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is not a brimpus and Wren is a zumpus and Wren is a yumpus.","Wren is not a brimpus.\n\n","Assume Wren is a numpus.","Numpuses are wumpuses, impuses, and tumpuses.","Wren is a wumpus, an impus, and a tumpus.","Wren is a tumpus.","Wren is a shumpus or a dumpus or a tumpus.","Everything that is a shumpus, a dumpus, or a tumpus is a brimpus.","Wren is a brimpus.","This contradicts with Wren is not a brimpus.","Wren is not a numpus.\n\n"]}
{"input":"Context: Grimpuses are lempuses. Each brimpus is a gorpus. Everything that is a dumpus or a sterpus or a rompus is a numpus. Jompuses are shumpuses. Everything that is a shumpus or a sterpus or a gorpus is a tumpus. Everything that is a rompus or a gorpus or a wumpus is a numpus. Everything that is a dumpus, a sterpus, or a rompus is a grimpus. Grimpuses are sterpuses. Alex is a gorpus and a wumpus and a lempus. Alex is a brimpus and a jompus and a rompus.\nQuestion: Alex is a rompus or a sterpus or a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a brimpus and a jompus and a rompus.","Alex is a rompus.","Alex is a dumpus or a sterpus or a rompus.","Everything that is a dumpus, a sterpus, or a rompus is a grimpus.","Alex is a grimpus.","Grimpuses are sterpuses.","Alex is a sterpus.","Alex is a rompus, a sterpus, or a yumpus."]}
{"input":"Context: Sam is an impus. Everything that is an impus, a lorpus, and a gorpus is a sterpus and a grimpus and a yumpus. Yumpuses are gorpuses. Sam is a numpus. Tumpuses are lorpuses. Every yumpus is a rompus. Each lempus is an impus. Everything that is an impus, a numpus, and a rompus is a shumpus. Everything that is an impus and a lorpus and a gorpus is a numpus. Every grimpus is a dumpus. Sam is a rompus. Everything that is a sterpus or a wumpus or a shumpus is a dumpus. Each lempus is a dumpus. Sam is a lempus. Sam is a rompus. Sam is a tumpus. Sam is a yumpus.\nQuestion: Sam is a zumpus or a brimpus or a sterpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a yumpus.","Yumpuses are gorpuses.","Sam is a gorpus.","Sam is a tumpus.","Tumpuses are lorpuses.","Sam is a lorpus.","Sam is a lempus.","Each lempus is an impus.","Sam is an impus.","Sam is an impus and a lorpus and a gorpus.","Everything that is an impus, a lorpus, and a gorpus is a sterpus and a grimpus and a yumpus.","Sam is a sterpus and a grimpus and a yumpus.","Sam is a sterpus.","Sam is a zumpus, a brimpus, or a sterpus."]}
{"input":"Context: Numpuses are yumpuses. Each dumpus is a shumpus. Sally is a shumpus. Everything that is a shumpus or a rompus or a tumpus is a brimpus. Everything that is a grimpus, a gorpus, or a rompus is a vumpus. Every grimpus is a lorpus. Wumpuses are yumpuses. Everything that is a grimpus, a gorpus, or a rompus is a lorpus. Each vumpus is a tumpus. Wumpuses are rompuses, grimpuses, and vumpuses. Every shumpus is a vumpus. Sally is a yumpus, a shumpus, and a jompus. Sally is a dumpus and Sally is a numpus and Sally is not a vumpus.\nQuestion: Sally is not a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a dumpus and Sally is a numpus and Sally is not a vumpus.","Sally is not a vumpus.\n\n","Assume Sally is a wumpus.","Wumpuses are rompuses, grimpuses, and vumpuses.","Sally is a rompus, a grimpus, and a vumpus.","Sally is a rompus.","Sally is a grimpus, a gorpus, or a rompus.","Everything that is a grimpus, a gorpus, or a rompus is a vumpus.","Sally is a vumpus.","This contradicts with Sally is not a vumpus.","Sally is not a wumpus.\n\n"]}
{"input":"Context: Each brimpus is a dumpus. Each lempus is a lorpus. Yumpuses are wumpuses. Everything that is a zumpus, a gorpus, or a dumpus is a tumpus. Every rompus is a vumpus, a sterpus, and a yumpus. Everything that is a jompus or a gorpus or a grimpus is a lempus, a rompus, and a brimpus. Rompuses are lorpuses. Everything that is a jompus or a gorpus or a grimpus is a lorpus. Every sterpus is a zumpus. Alex is a shumpus. Alex is a gorpus.\nQuestion: Alex is a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a gorpus.","Alex is a jompus or a gorpus or a grimpus.","Everything that is a jompus or a gorpus or a grimpus is a lempus, a rompus, and a brimpus.","Alex is a lempus, a rompus, and a brimpus.","Alex is a rompus.","Every rompus is a vumpus, a sterpus, and a yumpus.","Alex is a vumpus and a sterpus and a yumpus.","Alex is a vumpus."]}
{"input":"Context: Alex is an impus. Alex is a zumpus. Everything that is a tumpus or a shumpus or a vumpus is a wumpus. Grimpuses are yumpuses. Alex is a numpus. Everything that is an impus, a sterpus, and a brimpus is a numpus. Everything that is an impus and a sterpus and a brimpus is a tumpus, a jompus, and a grimpus. Everything that is a tumpus or a shumpus or a vumpus is a gorpus. Everything that is a numpus, an impus, and a zumpus is a lempus. Everything that is a tumpus, a zumpus, or a lempus is a yumpus. Every jompus is a rompus. Alex is a lorpus. Alex is an impus. Alex is a sterpus. Alex is a brimpus.\nQuestion: Alex is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a brimpus.","Alex is a sterpus.","Alex is an impus.","Alex is an impus and a sterpus and a brimpus.","Everything that is an impus and a sterpus and a brimpus is a tumpus, a jompus, and a grimpus.","Alex is a tumpus and a jompus and a grimpus.","Alex is a tumpus.","Alex is a tumpus, a shumpus, or a vumpus.","Everything that is a tumpus or a shumpus or a vumpus is a gorpus.","Alex is a gorpus."]}
{"input":"Context: Jompuses are wumpuses, yumpuses, and gorpuses. Jompuses are rompuses. Wumpuses are rompuses. Lorpuses are brimpuses. Everything that is a grimpus or a shumpus or a numpus is a sterpus. Yumpuses are dumpuses. Wumpuses are lorpuses. Gorpuses are rompuses. Each lorpus is a grimpus. Fae is a numpus. Fae is a jompus.\nQuestion: Fae is a wumpus or a grimpus or a lempus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a jompus.","Jompuses are wumpuses, yumpuses, and gorpuses.","Fae is a wumpus and a yumpus and a gorpus.","Fae is a wumpus.","Wumpuses are lorpuses.","Fae is a lorpus.","Each lorpus is a grimpus.","Fae is a grimpus.","Fae is a wumpus or a grimpus or a lempus."]}
{"input":"Context: Each sterpus is a jompus. Zumpuses are sterpuses, grimpuses, and impuses. Fae is a jompus. Each zumpus is a brimpus. Each tumpus is a gorpus. Grimpuses are tumpuses, yumpuses, and rompuses. Every vumpus is a shumpus. Yumpuses are dumpuses. Grimpuses are brimpuses. Jompuses are rompuses. Wumpuses are lempuses. Every impus is a lempus. Fae is a jompus, a shumpus, and a numpus. Fae is a vumpus, Fae is not a rompus, and Fae is a wumpus.\nQuestion: Fae is not a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a vumpus and Fae is not a rompus and Fae is a wumpus.","Fae is not a rompus.\n\n","Assume Fae is a zumpus.","Zumpuses are sterpuses, grimpuses, and impuses.","Fae is a sterpus, a grimpus, and an impus.","Fae is a grimpus.","Grimpuses are tumpuses, yumpuses, and rompuses.","Fae is a tumpus and a yumpus and a rompus.","Fae is a rompus.","This contradicts with Fae is not a rompus.","Fae is not a zumpus.\n\n"]}
{"input":"Context: Wumpuses are lempuses. Everything that is a brimpus or a sterpus or a jompus is a rompus. Lorpuses are rompuses. Each shumpus is a gorpus. Everything that is a brimpus, a sterpus, or a jompus is a shumpus, a lorpus, and a wumpus. Every wumpus is an impus. Lorpuses are numpuses. Everything that is a sterpus, a vumpus, or a lempus is a zumpus. Every tumpus is a rompus. Sally is a yumpus, a vumpus, and a rompus. Sally is a tumpus, a wumpus, and a sterpus.\nQuestion: Sally is a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a tumpus, a wumpus, and a sterpus.","Sally is a sterpus.","Sally is a brimpus or a sterpus or a jompus.","Everything that is a brimpus, a sterpus, or a jompus is a shumpus, a lorpus, and a wumpus.","Sally is a shumpus and a lorpus and a wumpus.","Sally is a lorpus.","Lorpuses are numpuses.","Sally is a numpus."]}
{"input":"Context: Everything that is a gorpus, a jompus, or a lempus is a wumpus, a shumpus, and a brimpus. Everything that is a gorpus, a jompus, or a lempus is a lorpus. Shumpuses are vumpuses. Everything that is a tumpus or a gorpus or a yumpus is a zumpus. Wumpuses are zumpuses. Every dumpus is a tumpus. Everything that is a wumpus, a grimpus, or a tumpus is a rompus. Brimpuses are zumpuses. Stella is a sterpus, a yumpus, and a tumpus. Stella is a gorpus and a wumpus and a dumpus.\nQuestion: Stella is a shumpus, a wumpus, or a lempus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a gorpus, a wumpus, and a dumpus.","Stella is a gorpus.","Stella is a gorpus or a jompus or a lempus.","Everything that is a gorpus, a jompus, or a lempus is a wumpus, a shumpus, and a brimpus.","Stella is a wumpus, a shumpus, and a brimpus.","Stella is a wumpus.","Stella is a shumpus, a wumpus, or a lempus."]}
{"input":"Context: Everything that is a sterpus, a zumpus, or a tumpus is a shumpus. Everything that is a gorpus or a lorpus or a zumpus is a shumpus. Grimpuses are yumpuses. Everything that is an impus, a gorpus, or a dumpus is a zumpus. Everything that is a shumpus or a dumpus or a brimpus is a sterpus. Numpuses are sterpuses. Everything that is an impus or a gorpus or a dumpus is a sterpus. Everything that is a gorpus or a lorpus or a zumpus is a grimpus, a wumpus, and a numpus. Alex is a yumpus. Alex is a dumpus.\nQuestion: Alex is a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a dumpus.","Alex is an impus or a gorpus or a dumpus.","Everything that is an impus, a gorpus, or a dumpus is a zumpus.","Alex is a zumpus.","Alex is a gorpus, a lorpus, or a zumpus.","Everything that is a gorpus or a lorpus or a zumpus is a grimpus, a wumpus, and a numpus.","Alex is a grimpus, a wumpus, and a numpus.","Alex is a wumpus."]}
{"input":"Context: Zumpuses are lorpuses. Everything that is a vumpus, a shumpus, or a rompus is a jompus. Everything that is a brimpus or a vumpus or a wumpus is a yumpus. Every grimpus is a shumpus. Sterpuses are gorpuses. Zumpuses are grimpuses. Grimpuses are sterpuses and tumpuses and vumpuses. Every tumpus is a dumpus. Everything that is a brimpus, a vumpus, or a wumpus is a jompus. Sally is a dumpus. Sally is a zumpus.\nQuestion: Sally is a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a zumpus.","Zumpuses are grimpuses.","Sally is a grimpus.","Grimpuses are sterpuses and tumpuses and vumpuses.","Sally is a sterpus, a tumpus, and a vumpus.","Sally is a vumpus.","Sally is a brimpus or a vumpus or a wumpus.","Everything that is a brimpus or a vumpus or a wumpus is a yumpus.","Sally is a yumpus."]}
{"input":"Context: Everything that is an impus or a grimpus or a shumpus is a dumpus. Each numpus is a shumpus. Everything that is a gorpus, a shumpus, or a zumpus is a brimpus. Wumpuses are vumpuses. Each wumpus is a numpus and a jompus and a gorpus. Everything that is a tumpus, a sterpus, or a gorpus is a grimpus. Jompuses are impuses. Everything that is a tumpus or a sterpus or a gorpus is a brimpus. Fae is a shumpus. Fae is a wumpus.\nQuestion: Fae is a jompus, a lorpus, or a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a wumpus.","Each wumpus is a numpus and a jompus and a gorpus.","Fae is a numpus, a jompus, and a gorpus.","Fae is a gorpus.","Fae is a tumpus, a sterpus, or a gorpus.","Everything that is a tumpus, a sterpus, or a gorpus is a grimpus.","Fae is a grimpus.","Fae is a jompus, a lorpus, or a grimpus."]}
{"input":"Context: Everything that is a shumpus, a dumpus, or a wumpus is a rompus. Every lempus is a brimpus. Everything that is a shumpus, a dumpus, or a wumpus is a zumpus. Everything that is a yumpus, a dumpus, or a tumpus is a gorpus. Vumpuses are tumpuses. Each shumpus is a yumpus. Every rompus is a tumpus. Each rompus is a shumpus. Every shumpus is a vumpus and a lempus and a jompus. Rex is a sterpus. Rex is a dumpus.\nQuestion: Rex is a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a dumpus.","Rex is a shumpus or a dumpus or a wumpus.","Everything that is a shumpus, a dumpus, or a wumpus is a rompus.","Rex is a rompus.","Each rompus is a shumpus.","Rex is a shumpus.","Every shumpus is a vumpus and a lempus and a jompus.","Rex is a vumpus, a lempus, and a jompus.","Rex is a jompus."]}
{"input":"Context: Each brimpus is a yumpus. Lempuses are vumpuses. Shumpuses are yumpuses. Everything that is a shumpus, a tumpus, or a vumpus is a sterpus. Each impus is a grimpus and a shumpus and a lempus. Each zumpus is a gorpus. Grimpuses are shumpuses, zumpuses, and brimpuses. Impuses are yumpuses. Every grimpus is a tumpus. Rex is a sterpus. Rex is an impus.\nQuestion: Rex is a shumpus, a numpus, or a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is an impus.","Each impus is a grimpus and a shumpus and a lempus.","Rex is a grimpus, a shumpus, and a lempus.","Rex is a grimpus.","Grimpuses are shumpuses, zumpuses, and brimpuses.","Rex is a shumpus and a zumpus and a brimpus.","Rex is a shumpus.","Rex is a shumpus or a numpus or a jompus."]}
{"input":"Context: Tumpuses are rompuses. Wren is a rompus. Brimpuses are tumpuses, wumpuses, and lempuses. Each wumpus is a dumpus. Everything that is a vumpus and a wumpus and a yumpus is an impus. Wren is a grimpus. Everything that is a vumpus and a wumpus and a yumpus is a zumpus and a brimpus and a shumpus. Shumpuses are jompuses. Wren is a vumpus. Brimpuses are impuses. Everything that is a rompus, a vumpus, and a grimpus is a lorpus. Every zumpus is a dumpus. Wren is a vumpus. Wren is a jompus. Wren is a wumpus. Wren is a yumpus.\nQuestion: Wren is a lempus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a yumpus.","Wren is a wumpus.","Wren is a vumpus.","Wren is a vumpus, a wumpus, and a yumpus.","Everything that is a vumpus and a wumpus and a yumpus is a zumpus and a brimpus and a shumpus.","Wren is a zumpus and a brimpus and a shumpus.","Wren is a brimpus.","Brimpuses are tumpuses, wumpuses, and lempuses.","Wren is a tumpus, a wumpus, and a lempus.","Wren is a lempus."]}
{"input":"Context: Every zumpus is a lorpus. Wumpuses are jompuses. Everything that is a wumpus or a vumpus or a rompus is a tumpus. Zumpuses are vumpuses. Everything that is a vumpus, a brimpus, or a shumpus is a gorpus. Each dumpus is a brimpus. Yumpuses are grimpuses and dumpuses and wumpuses. Every yumpus is a lorpus. Everything that is a wumpus, a vumpus, or a rompus is a yumpus. Max is a lorpus. Max is a zumpus.\nQuestion: Max is a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a zumpus.","Zumpuses are vumpuses.","Max is a vumpus.","Max is a wumpus, a vumpus, or a rompus.","Everything that is a wumpus, a vumpus, or a rompus is a yumpus.","Max is a yumpus.","Yumpuses are grimpuses and dumpuses and wumpuses.","Max is a grimpus, a dumpus, and a wumpus.","Max is a grimpus."]}
{"input":"Context: Everything that is a yumpus, a grimpus, or a shumpus is a gorpus. Everything that is a yumpus or a zumpus or an impus is a lorpus. Jompuses are sterpuses, rompuses, and yumpuses. Everything that is a yumpus or a zumpus or an impus is a lempus. Each sterpus is a grimpus. Everything that is a lorpus or a wumpus or a lempus is a grimpus. Rompuses are wumpuses. Each jompus is a numpus. Wren is a lempus. Wren is a jompus.\nQuestion: Wren is a brimpus or a yumpus or a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a jompus.","Jompuses are sterpuses, rompuses, and yumpuses.","Wren is a sterpus and a rompus and a yumpus.","Wren is a yumpus.","Wren is a yumpus or a zumpus or an impus.","Everything that is a yumpus or a zumpus or an impus is a lorpus.","Wren is a lorpus.","Wren is a brimpus or a yumpus or a lorpus."]}
{"input":"Context: Every impus is a shumpus. Each jompus is an impus, a gorpus, and a tumpus. Each gorpus is a brimpus. Rompuses are dumpuses. Everything that is a brimpus, a vumpus, or a grimpus is a lempus. Tumpuses are vumpuses. Tumpuses are shumpuses. Sterpuses are lorpuses. Each jompus is a dumpus. Polly is a grimpus and a lorpus and a wumpus. Polly is a sterpus, a rompus, and a jompus.\nQuestion: Polly is a vumpus, a tumpus, or a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a sterpus and a rompus and a jompus.","Polly is a jompus.","Each jompus is an impus, a gorpus, and a tumpus.","Polly is an impus, a gorpus, and a tumpus.","Polly is a tumpus.","Tumpuses are vumpuses.","Polly is a vumpus.","Polly is a vumpus, a tumpus, or a yumpus."]}
{"input":"Context: Everything that is a lorpus or a tumpus or a sterpus is a yumpus. Tumpuses are rompuses. Everything that is a lorpus or a tumpus or a sterpus is a numpus. Every numpus is an impus. Everything that is a dumpus, a sterpus, or a rompus is a grimpus. Jompuses are wumpuses. Each impus is a vumpus. Each impus is a shumpus. Numpuses are wumpuses. Stella is a rompus and a yumpus and a gorpus. Stella is a sterpus, a tumpus, and a jompus.\nQuestion: Stella is a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a sterpus, a tumpus, and a jompus.","Stella is a sterpus.","Stella is a lorpus, a tumpus, or a sterpus.","Everything that is a lorpus or a tumpus or a sterpus is a numpus.","Stella is a numpus.","Every numpus is an impus.","Stella is an impus.","Each impus is a vumpus.","Stella is a vumpus."]}
{"input":"Context: Numpuses are tumpuses. Everything that is a gorpus, a grimpus, or a tumpus is a zumpus. Everything that is a gorpus or a lorpus or a shumpus is a wumpus, a vumpus, and a rompus. Everything that is a gorpus or a lorpus or a shumpus is a jompus. Rompuses are brimpuses. Vumpuses are zumpuses. Vumpuses are numpuses and rompuses and gorpuses. Each vumpus is a grimpus. Rompuses are lempuses. Polly is a jompus. Polly is a vumpus.\nQuestion: Polly is a wumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a vumpus.","Vumpuses are numpuses and rompuses and gorpuses.","Polly is a numpus and a rompus and a gorpus.","Polly is a gorpus.","Polly is a gorpus, a lorpus, or a shumpus.","Everything that is a gorpus or a lorpus or a shumpus is a wumpus, a vumpus, and a rompus.","Polly is a wumpus, a vumpus, and a rompus.","Polly is a wumpus."]}
{"input":"Context: Every impus is a wumpus and a shumpus and a tumpus. Tumpuses are gorpuses. Everything that is a rompus or a lempus or a gorpus is a vumpus. Shumpuses are grimpuses. Every impus is a zumpus. Everything that is a yumpus, a sterpus, or a lempus is a jompus and a tumpus and an impus. Jompuses are numpuses. Everything that is a yumpus or a sterpus or a lempus is a zumpus. Wumpuses are brimpuses. Stella is a rompus. Stella is a lempus.\nQuestion: Stella is a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a lempus.","Stella is a yumpus or a sterpus or a lempus.","Everything that is a yumpus, a sterpus, or a lempus is a jompus and a tumpus and an impus.","Stella is a jompus, a tumpus, and an impus.","Stella is an impus.","Every impus is a wumpus and a shumpus and a tumpus.","Stella is a wumpus, a shumpus, and a tumpus.","Stella is a tumpus."]}
{"input":"Context: Each zumpus is a jompus. Everything that is a numpus, a sterpus, or a lorpus is a rompus, a tumpus, and a zumpus. Tumpuses are wumpuses. Tumpuses are yumpuses. Every lempus is a vumpus. Each rompus is an impus. Everything that is a dumpus, a lorpus, or a grimpus is an impus. Everything that is a numpus, a sterpus, or a lorpus is a vumpus. Every gorpus is an impus. Fae is a jompus, a wumpus, and a vumpus. Fae is a gorpus and a lorpus and a lempus.\nQuestion: Fae is a yumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a gorpus, a lorpus, and a lempus.","Fae is a lorpus.","Fae is a numpus or a sterpus or a lorpus.","Everything that is a numpus, a sterpus, or a lorpus is a rompus, a tumpus, and a zumpus.","Fae is a rompus, a tumpus, and a zumpus.","Fae is a tumpus.","Tumpuses are yumpuses.","Fae is a yumpus."]}
{"input":"Context: Numpuses are yumpuses. Every impus is a vumpus. Each lorpus is a yumpus. Everything that is a rompus or a lorpus or a tumpus is a sterpus and a numpus and an impus. Everything that is a gorpus or a lorpus or a brimpus is a vumpus. Sterpuses are grimpuses. Everything that is a rompus or a lorpus or a tumpus is a jompus. Every wumpus is a gorpus. Each numpus is a lorpus, a wumpus, and a shumpus. Stella is a vumpus. Stella is a lorpus.\nQuestion: Stella is a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a lorpus.","Stella is a rompus or a lorpus or a tumpus.","Everything that is a rompus or a lorpus or a tumpus is a sterpus and a numpus and an impus.","Stella is a sterpus and a numpus and an impus.","Stella is a numpus.","Each numpus is a lorpus, a wumpus, and a shumpus.","Stella is a lorpus, a wumpus, and a shumpus.","Stella is a shumpus."]}
{"input":"Context: Everything that is a shumpus and an impus and a vumpus is a numpus. Everything that is a shumpus, a gorpus, and a tumpus is a grimpus. Alex is a shumpus. Alex is a vumpus. Shumpuses are impuses. Each sterpus is a vumpus. Everything that is a jompus or a grimpus or a lorpus is a rompus. Everything that is a zumpus, a grimpus, or a lempus is a wumpus. Alex is an impus. Every impus is a wumpus. Everything that is a shumpus and a gorpus and a tumpus is a jompus. Everything that is a zumpus, a grimpus, or a lempus is an impus. Alex is a sterpus and Alex is a shumpus and Alex is not a wumpus. Alex is a shumpus. Alex is a brimpus and a vumpus and a jompus. Alex is a tumpus.\nQuestion: Alex is not a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a sterpus and Alex is a shumpus and Alex is not a wumpus.","Alex is not a wumpus.","Alex is a tumpus.\n\n","Assume Alex is a gorpus.","Alex is a shumpus.","Alex is a shumpus, a gorpus, and a tumpus.","Everything that is a shumpus, a gorpus, and a tumpus is a grimpus.","Alex is a grimpus.","Alex is a zumpus or a grimpus or a lempus.","Everything that is a zumpus, a grimpus, or a lempus is a wumpus.","Alex is a wumpus.","This contradicts with Alex is not a wumpus.","Alex is not a gorpus.\n\n"]}
{"input":"Context: Lempuses are shumpuses. Every numpus is a wumpus. Each numpus is a lempus, a zumpus, and a gorpus. Zumpuses are grimpuses. Each lempus is an impus. Each gorpus is a rompus. Everything that is a vumpus or a jompus or a brimpus is a rompus. Every yumpus is a wumpus. Each zumpus is a vumpus. Sally is a wumpus and a jompus and a dumpus. Sally is a yumpus and a numpus and a lempus.\nQuestion: Sally is a tumpus or a gorpus or a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a yumpus, a numpus, and a lempus.","Sally is a numpus.","Each numpus is a lempus, a zumpus, and a gorpus.","Sally is a lempus and a zumpus and a gorpus.","Sally is a zumpus.","Each zumpus is a vumpus.","Sally is a vumpus.","Sally is a tumpus, a gorpus, or a vumpus."]}
{"input":"Context: Rompuses are grimpuses and shumpuses and wumpuses. Every brimpus is a lempus. Jompuses are lempuses. Each rompus is a zumpus. Everything that is a shumpus, a zumpus, or a dumpus is a gorpus. Grimpuses are zumpuses. Brimpuses are jompuses, rompuses, and wumpuses. Each wumpus is a vumpus. Wumpuses are sterpuses. Wren is a sterpus. Wren is a brimpus.\nQuestion: Wren is an impus or a shumpus or a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a brimpus.","Brimpuses are jompuses, rompuses, and wumpuses.","Wren is a jompus, a rompus, and a wumpus.","Wren is a rompus.","Rompuses are grimpuses and shumpuses and wumpuses.","Wren is a grimpus, a shumpus, and a wumpus.","Wren is a shumpus.","Wren is an impus, a shumpus, or a lorpus."]}
{"input":"Context: Polly is a lorpus. Every brimpus is a zumpus. Dumpuses are gorpuses. Everything that is a lorpus and a yumpus and a rompus is a tumpus. Shumpuses are vumpuses. Grimpuses are vumpuses. Everything that is a yumpus, a sterpus, and a numpus is a rompus. Polly is a rompus. Grimpuses are impuses and yumpuses and brimpuses. Everything that is a yumpus, a sterpus, and a numpus is a dumpus and a grimpus and a shumpus. Polly is a yumpus. Each yumpus is a lempus. Polly is a yumpus. Polly is a gorpus. Polly is a sterpus. Polly is a numpus.\nQuestion: Polly is an impus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a numpus.","Polly is a sterpus.","Polly is a yumpus.","Polly is a yumpus, a sterpus, and a numpus.","Everything that is a yumpus, a sterpus, and a numpus is a dumpus and a grimpus and a shumpus.","Polly is a dumpus and a grimpus and a shumpus.","Polly is a grimpus.","Grimpuses are impuses and yumpuses and brimpuses.","Polly is an impus, a yumpus, and a brimpus.","Polly is an impus."]}
{"input":"Context: Everything that is a sterpus, a gorpus, or a grimpus is a lempus and a shumpus and a jompus. Everything that is a sterpus, a gorpus, or a grimpus is a tumpus. Every numpus is a wumpus. Everything that is a sterpus or an impus or a lorpus is a tumpus. Each lempus is a zumpus. Numpuses are grimpuses and lempuses and sterpuses. Lempuses are dumpuses. Jompuses are tumpuses. Each grimpus is an impus. Sam is a lorpus. Sam is a numpus.\nQuestion: Sam is a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a numpus.","Numpuses are grimpuses and lempuses and sterpuses.","Sam is a grimpus, a lempus, and a sterpus.","Sam is a sterpus.","Sam is a sterpus, a gorpus, or a grimpus.","Everything that is a sterpus, a gorpus, or a grimpus is a lempus and a shumpus and a jompus.","Sam is a lempus, a shumpus, and a jompus.","Sam is a shumpus."]}
{"input":"Context: Everything that is a yumpus or a dumpus or a vumpus is a gorpus and a lempus and a zumpus. Zumpuses are grimpuses. Shumpuses are brimpuses. Everything that is a yumpus, a dumpus, or a vumpus is a sterpus. Yumpuses are sterpuses. Each lempus is a sterpus. Everything that is a dumpus, a wumpus, or a brimpus is a tumpus. Each zumpus is a gorpus. Gorpuses are lorpuses. Wren is a lorpus, an impus, and a sterpus. Wren is a dumpus, a shumpus, and a yumpus.\nQuestion: Wren is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a dumpus and a shumpus and a yumpus.","Wren is a dumpus.","Wren is a yumpus or a dumpus or a vumpus.","Everything that is a yumpus or a dumpus or a vumpus is a gorpus and a lempus and a zumpus.","Wren is a gorpus, a lempus, and a zumpus.","Wren is a zumpus.","Each zumpus is a gorpus.","Wren is a gorpus."]}
{"input":"Context: Wren is a grimpus. Tumpuses are grimpuses. Each brimpus is a grimpus. Wren is a lorpus. Wren is a vumpus. Everything that is a lorpus and a lempus and a dumpus is a zumpus. Everything that is a lorpus and a vumpus and a grimpus is a rompus. Wren is an impus. Brimpuses are lempuses. Each tumpus is a lorpus. Every numpus is a jompus. Each numpus is a vumpus. Everything that is a lorpus and a lempus and a dumpus is a sterpus and a numpus and a brimpus. Every brimpus is a yumpus. Impuses are sterpuses. Each wumpus is a dumpus. Wren is an impus, a jompus, and a yumpus. Wren is a numpus, Wren is a brimpus, and Wren is not a sterpus. Wren is a tumpus. Wren is a wumpus.\nQuestion: Wren is not a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a numpus and Wren is a brimpus and Wren is not a sterpus.","Wren is not a sterpus.","Wren is a wumpus.","Each wumpus is a dumpus.","Wren is a dumpus.\n\n","Assume Wren is a brimpus.","Brimpuses are lempuses.","Wren is a lempus.","Wren is a tumpus.","Each tumpus is a lorpus.","Wren is a lorpus.","Wren is a lorpus, a lempus, and a dumpus.","Everything that is a lorpus and a lempus and a dumpus is a sterpus and a numpus and a brimpus.","Wren is a sterpus, a numpus, and a brimpus.","Wren is a sterpus.","This contradicts with Wren is not a sterpus.","Wren is not a brimpus.\n\n"]}
{"input":"Context: Everything that is a brimpus, a shumpus, or a sterpus is a wumpus. Sterpuses are grimpuses. Vumpuses are gorpuses. Every jompus is a yumpus. Each lorpus is an impus. Everything that is an impus or a sterpus or a grimpus is a wumpus. Every numpus is a lempus. Everything that is a brimpus, a shumpus, or a sterpus is a lorpus. Lorpuses are sterpuses, numpuses, and rompuses. Wren is an impus, a lempus, and a dumpus. Wren is a jompus and a sterpus and a vumpus.\nQuestion: Wren is a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a jompus and a sterpus and a vumpus.","Wren is a sterpus.","Wren is a brimpus or a shumpus or a sterpus.","Everything that is a brimpus, a shumpus, or a sterpus is a lorpus.","Wren is a lorpus.","Lorpuses are sterpuses, numpuses, and rompuses.","Wren is a sterpus, a numpus, and a rompus.","Wren is a rompus."]}
{"input":"Context: Numpuses are lorpuses. Every tumpus is a lorpus. Everything that is a gorpus or a zumpus or a yumpus is a tumpus. Each brimpus is a dumpus. Sally is a lorpus. Everything that is a gorpus, a zumpus, or a yumpus is a jompus. Everything that is a gorpus or a lorpus or a wumpus is a shumpus. Each tumpus is a vumpus, a numpus, and an impus. Every lorpus is a vumpus. Every impus is a dumpus. Each rompus is a grimpus. Sally is a lempus and a jompus and a shumpus. Sally is a brimpus, Sally is a rompus, and Sally is not a vumpus.\nQuestion: Sally is not a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a brimpus, Sally is a rompus, and Sally is not a vumpus.","Sally is not a vumpus.\n\n","Assume Sally is a gorpus.","Sally is a gorpus or a zumpus or a yumpus.","Everything that is a gorpus or a zumpus or a yumpus is a tumpus.","Sally is a tumpus.","Each tumpus is a vumpus, a numpus, and an impus.","Sally is a vumpus and a numpus and an impus.","Sally is a vumpus.","This contradicts with Sally is not a vumpus.","Sally is not a gorpus.\n\n"]}
{"input":"Context: Each numpus is a vumpus. Yumpuses are lempuses. Everything that is a wumpus and a zumpus and a shumpus is a jompus. Fae is a brimpus. Shumpuses are rompuses. Every dumpus is a lorpus. Fae is a sterpus. Everything that is a wumpus, a zumpus, and a shumpus is a numpus, a dumpus, and a yumpus. Every grimpus is a vumpus. Every yumpus is a gorpus and a shumpus and a grimpus. Fae is a wumpus. Everything that is a wumpus, a sterpus, and a brimpus is a lorpus. Fae is a sterpus. Fae is a wumpus. Fae is a zumpus. Fae is a shumpus.\nQuestion: Fae is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a shumpus.","Fae is a zumpus.","Fae is a wumpus.","Fae is a wumpus and a zumpus and a shumpus.","Everything that is a wumpus, a zumpus, and a shumpus is a numpus, a dumpus, and a yumpus.","Fae is a numpus and a dumpus and a yumpus.","Fae is a yumpus.","Every yumpus is a gorpus and a shumpus and a grimpus.","Fae is a gorpus and a shumpus and a grimpus.","Fae is a gorpus."]}
{"input":"Context: Polly is a sterpus. Each wumpus is a yumpus. Everything that is a jompus and a sterpus and a grimpus is a numpus. Everything that is a sterpus and a shumpus and a rompus is a tumpus. Impuses are tumpuses. Everything that is a sterpus, a shumpus, and a rompus is a wumpus and a gorpus and an impus. Everything that is a jompus, a dumpus, or a lempus is a lorpus. Polly is a jompus. Gorpuses are tumpuses. Every impus is a dumpus. Polly is a grimpus. Polly is a jompus. Polly is a sterpus. Polly is a shumpus. Polly is a rompus.\nQuestion: Polly is an impus, a dumpus, or a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a rompus.","Polly is a shumpus.","Polly is a sterpus.","Polly is a sterpus, a shumpus, and a rompus.","Everything that is a sterpus, a shumpus, and a rompus is a wumpus and a gorpus and an impus.","Polly is a wumpus and a gorpus and an impus.","Polly is an impus.","Every impus is a dumpus.","Polly is a dumpus.","Polly is an impus or a dumpus or a gorpus."]}
{"input":"Context: Dumpuses are jompuses. Everything that is a jompus or a tumpus or a wumpus is a zumpus and a dumpus and a brimpus. Each jompus is a sterpus. Everything that is a jompus, a tumpus, or a wumpus is a sterpus. Each brimpus is an impus. Jompuses are vumpuses. Everything that is a lempus, a tumpus, or a lorpus is a shumpus. Zumpuses are shumpuses. Each dumpus is an impus. Sam is a sterpus. Sam is a tumpus.\nQuestion: Sam is a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a tumpus.","Sam is a jompus or a tumpus or a wumpus.","Everything that is a jompus or a tumpus or a wumpus is a zumpus and a dumpus and a brimpus.","Sam is a zumpus, a dumpus, and a brimpus.","Sam is a dumpus.","Dumpuses are jompuses.","Sam is a jompus.","Jompuses are vumpuses.","Sam is a vumpus."]}
{"input":"Context: Everything that is a lempus and a zumpus and a grimpus is a dumpus. Everything that is a lempus, a rompus, and a shumpus is an impus. Each lorpus is a rompus. Every wumpus is a lempus. Every wumpus is a grimpus. Jompuses are brimpuses. Sally is a zumpus. Everything that is a lempus and a rompus and a shumpus is a sterpus. Every vumpus is a grimpus. Every impus is a gorpus, a vumpus, and a jompus. Impuses are brimpuses. Sally is a lempus. Sally is a grimpus. Tumpuses are shumpuses. Sally is a wumpus. Sally is a grimpus. Sally is a lorpus. Sally is a tumpus.\nQuestion: Sally is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a tumpus.","Tumpuses are shumpuses.","Sally is a shumpus.","Sally is a lorpus.","Each lorpus is a rompus.","Sally is a rompus.","Sally is a wumpus.","Every wumpus is a lempus.","Sally is a lempus.","Sally is a lempus, a rompus, and a shumpus.","Everything that is a lempus, a rompus, and a shumpus is an impus.","Sally is an impus.","Every impus is a gorpus, a vumpus, and a jompus.","Sally is a gorpus and a vumpus and a jompus.","Sally is a gorpus."]}
{"input":"Context: Each rompus is a shumpus. Jompuses are rompuses. Everything that is a yumpus, a tumpus, or a rompus is a numpus. Everything that is a yumpus, a tumpus, or a rompus is a gorpus. Rompuses are tumpuses. Each vumpus is a zumpus. Jompuses are sterpuses. Everything that is a numpus or a tumpus or a zumpus is an impus. Each brimpus is a lorpus. Fae is a lorpus and a grimpus and a numpus. Fae is a brimpus and a jompus and a vumpus.\nQuestion: Fae is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a brimpus, a jompus, and a vumpus.","Fae is a jompus.","Jompuses are rompuses.","Fae is a rompus.","Rompuses are tumpuses.","Fae is a tumpus.","Fae is a yumpus or a tumpus or a rompus.","Everything that is a yumpus, a tumpus, or a rompus is a gorpus.","Fae is a gorpus."]}
{"input":"Context: Everything that is a wumpus or a gorpus or a brimpus is a zumpus and a numpus and a tumpus. Every lempus is a shumpus. Everything that is a wumpus, a gorpus, or a brimpus is a grimpus. Each zumpus is a lorpus. Each numpus is a grimpus. Everything that is a yumpus or a wumpus or a rompus is a lorpus. Every impus is a jompus. Dumpuses are jompuses. Every impus is a wumpus, a dumpus, and a lempus. Polly is a rompus. Polly is an impus.\nQuestion: Polly is a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is an impus.","Every impus is a wumpus, a dumpus, and a lempus.","Polly is a wumpus, a dumpus, and a lempus.","Polly is a wumpus.","Polly is a wumpus, a gorpus, or a brimpus.","Everything that is a wumpus or a gorpus or a brimpus is a zumpus and a numpus and a tumpus.","Polly is a zumpus, a numpus, and a tumpus.","Polly is a tumpus."]}
{"input":"Context: Each vumpus is a tumpus. Every lempus is a sterpus. Every vumpus is a jompus. Lempuses are brimpuses. Everything that is a grimpus, a brimpus, or a gorpus is an impus. Every jompus is an impus. Jompuses are vumpuses, lempuses, and shumpuses. Each vumpus is a sterpus. Every shumpus is a gorpus. Max is a numpus. Max is a vumpus.\nQuestion: Max is a yumpus, a lempus, or a brimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a vumpus.","Every vumpus is a jompus.","Max is a jompus.","Jompuses are vumpuses, lempuses, and shumpuses.","Max is a vumpus and a lempus and a shumpus.","Max is a lempus.","Lempuses are brimpuses.","Max is a brimpus.","Max is a yumpus or a lempus or a brimpus."]}
{"input":"Context: Rompuses are grimpuses. Everything that is a vumpus, a yumpus, or a numpus is a tumpus. Dumpuses are sterpuses. Lempuses are impuses. Everything that is a jompus or a yumpus or a shumpus is a dumpus. Brimpuses are gorpuses. Dumpuses are brimpuses and shumpuses and lempuses. Everything that is a jompus, a yumpus, or a shumpus is a vumpus. Zumpuses are impuses. Sam is a gorpus, an impus, and a wumpus. Sam is a yumpus and a zumpus and a rompus.\nQuestion: Sam is a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a yumpus and a zumpus and a rompus.","Sam is a yumpus.","Sam is a jompus or a yumpus or a shumpus.","Everything that is a jompus or a yumpus or a shumpus is a dumpus.","Sam is a dumpus.","Dumpuses are brimpuses and shumpuses and lempuses.","Sam is a brimpus and a shumpus and a lempus.","Sam is a shumpus."]}
{"input":"Context: Each wumpus is a yumpus. Everything that is a gorpus, a numpus, or a sterpus is a yumpus. Everything that is a gorpus or a numpus or a sterpus is a vumpus and a shumpus and a wumpus. Every impus is a sterpus. Everything that is a rompus or a sterpus or a dumpus is a lempus. Every shumpus is a rompus. Everything that is a vumpus or a grimpus or a jompus is a dumpus. Impuses are yumpuses. Wren is a lorpus. Wren is an impus.\nQuestion: Wren is a sterpus or a shumpus or a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is an impus.","Every impus is a sterpus.","Wren is a sterpus.","Wren is a gorpus, a numpus, or a sterpus.","Everything that is a gorpus or a numpus or a sterpus is a vumpus and a shumpus and a wumpus.","Wren is a vumpus and a shumpus and a wumpus.","Wren is a vumpus.","Wren is a sterpus, a shumpus, or a vumpus."]}
{"input":"Context: Tumpuses are wumpuses. Every gorpus is a lorpus. Lempuses are wumpuses. Each gorpus is a jompus. Every brimpus is a numpus. Stella is a brimpus. Jompuses are rompuses. Every impus is a zumpus. Yumpuses are lorpuses. Each jompus is a yumpus, a numpus, and a tumpus. Vumpuses are brimpuses. Each vumpus is a gorpus. Stella is a zumpus, a rompus, and a dumpus. Stella is a lempus, Stella is not a numpus, and Stella is an impus.\nQuestion: Stella is not a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Stella is a lempus and Stella is not a numpus and Stella is an impus.","Stella is not a numpus.\n\n","Assume Stella is a vumpus.","Each vumpus is a gorpus.","Stella is a gorpus.","Each gorpus is a jompus.","Stella is a jompus.","Each jompus is a yumpus, a numpus, and a tumpus.","Stella is a yumpus, a numpus, and a tumpus.","Stella is a numpus.","This contradicts with Stella is not a numpus.","Stella is not a vumpus.\n\n"]}
{"input":"Context: Everything that is a sterpus or a rompus or a zumpus is a vumpus. Everything that is a grimpus, a rompus, or a shumpus is a lorpus. Everything that is a zumpus, a numpus, or a shumpus is a grimpus. Vumpuses are yumpuses. Dumpuses are numpuses. Each brimpus is a lempus. Everything that is a sterpus or a rompus or a zumpus is a lorpus. Every vumpus is a dumpus and a brimpus and a zumpus. Fae is a lempus. Fae is a rompus.\nQuestion: Fae is a zumpus, a jompus, or a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a rompus.","Fae is a sterpus, a rompus, or a zumpus.","Everything that is a sterpus or a rompus or a zumpus is a vumpus.","Fae is a vumpus.","Every vumpus is a dumpus and a brimpus and a zumpus.","Fae is a dumpus and a brimpus and a zumpus.","Fae is a zumpus.","Fae is a zumpus or a jompus or a gorpus."]}
{"input":"Context: Every gorpus is an impus. Tumpuses are zumpuses. Everything that is a lorpus, a grimpus, or a rompus is an impus. Everything that is a wumpus or a shumpus or an impus is a grimpus. Everything that is a yumpus, a vumpus, or a wumpus is a lorpus. Everything that is a yumpus, a vumpus, or a wumpus is a grimpus. Every jompus is a lempus. Each gorpus is a wumpus and a jompus and a tumpus. Fae is a grimpus. Fae is a gorpus.\nQuestion: Fae is a tumpus, a brimpus, or a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a gorpus.","Each gorpus is a wumpus and a jompus and a tumpus.","Fae is a wumpus, a jompus, and a tumpus.","Fae is a wumpus.","Fae is a yumpus, a vumpus, or a wumpus.","Everything that is a yumpus, a vumpus, or a wumpus is a lorpus.","Fae is a lorpus.","Fae is a tumpus or a brimpus or a lorpus."]}
{"input":"Context: Each impus is a brimpus. Each jompus is a sterpus. Each numpus is a wumpus and a jompus and a grimpus. Numpuses are shumpuses. Wren is a vumpus. Every tumpus is a shumpus. Wumpuses are sterpuses. Tumpuses are zumpuses and jompuses and numpuses. Each grimpus is a brimpus. Each vumpus is a jompus. Lorpuses are shumpuses. Each zumpus is a vumpus. Wren is a vumpus and a brimpus and a dumpus. Wren is a lorpus and Wren is not a jompus and Wren is an impus.\nQuestion: Wren is not a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a lorpus and Wren is not a jompus and Wren is an impus.","Wren is not a jompus.\n\n","Assume Wren is a tumpus.","Tumpuses are zumpuses and jompuses and numpuses.","Wren is a zumpus and a jompus and a numpus.","Wren is a numpus.","Each numpus is a wumpus and a jompus and a grimpus.","Wren is a wumpus and a jompus and a grimpus.","Wren is a jompus.","This contradicts with Wren is not a jompus.","Wren is not a tumpus.\n\n"]}
{"input":"Context: Every tumpus is a sterpus, a brimpus, and a shumpus. Tumpuses are lorpuses. Sterpuses are impuses. Dumpuses are numpuses. Everything that is a lempus, a gorpus, or a zumpus is a dumpus and a tumpus and a sterpus. Each brimpus is a grimpus. Everything that is an impus or a lempus or a numpus is a jompus. Everything that is a lempus or a gorpus or a zumpus is a numpus. Sally is an impus. Sally is a lempus.\nQuestion: Sally is a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a lempus.","Sally is a lempus, a gorpus, or a zumpus.","Everything that is a lempus, a gorpus, or a zumpus is a dumpus and a tumpus and a sterpus.","Sally is a dumpus, a tumpus, and a sterpus.","Sally is a tumpus.","Every tumpus is a sterpus, a brimpus, and a shumpus.","Sally is a sterpus and a brimpus and a shumpus.","Sally is a shumpus."]}
{"input":"Context: Yumpuses are rompuses. Each tumpus is a sterpus. Gorpuses are tumpuses and yumpuses and wumpuses. Each zumpus is a gorpus. Each grimpus is a rompus. Everything that is a shumpus or a tumpus or a dumpus is a brimpus. Every wumpus is a shumpus. Every zumpus is a sterpus. Gorpuses are vumpuses. Rex is a shumpus, a jompus, and a rompus. Rex is a tumpus and a zumpus and a grimpus.\nQuestion: Rex is an impus or a tumpus or a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a tumpus, a zumpus, and a grimpus.","Rex is a zumpus.","Each zumpus is a gorpus.","Rex is a gorpus.","Gorpuses are tumpuses and yumpuses and wumpuses.","Rex is a tumpus and a yumpus and a wumpus.","Rex is a tumpus.","Rex is an impus or a tumpus or a numpus."]}
{"input":"Context: Each yumpus is a shumpus. Dumpuses are wumpuses, rompuses, and yumpuses. Each dumpus is a numpus. Every wumpus is a grimpus. Everything that is a grimpus or a lempus or a vumpus is a brimpus. Everything that is a wumpus, a rompus, or a lempus is a brimpus. Everything that is a wumpus or a rompus or a lempus is a lorpus and a gorpus and a dumpus. Every gorpus is a zumpus. Every lorpus is a jompus. Wren is a numpus. Wren is a lempus.\nQuestion: Wren is a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a lempus.","Wren is a wumpus, a rompus, or a lempus.","Everything that is a wumpus or a rompus or a lempus is a lorpus and a gorpus and a dumpus.","Wren is a lorpus, a gorpus, and a dumpus.","Wren is a dumpus.","Dumpuses are wumpuses, rompuses, and yumpuses.","Wren is a wumpus and a rompus and a yumpus.","Wren is a rompus."]}
{"input":"Context: Everything that is a wumpus, a rompus, or a gorpus is a shumpus. Vumpuses are zumpuses and lorpuses and wumpuses. Each dumpus is a lempus. Everything that is a wumpus, a dumpus, or a yumpus is a vumpus. Every lorpus is a sterpus. Each wumpus is a tumpus. Vumpuses are sterpuses. Lorpuses are impuses. Everything that is a wumpus, a dumpus, or a yumpus is a shumpus. Rex is a brimpus, a rompus, and an impus. Rex is a lorpus, a dumpus, and a wumpus.\nQuestion: Rex is a zumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a lorpus and a dumpus and a wumpus.","Rex is a wumpus.","Rex is a wumpus, a dumpus, or a yumpus.","Everything that is a wumpus, a dumpus, or a yumpus is a vumpus.","Rex is a vumpus.","Vumpuses are zumpuses and lorpuses and wumpuses.","Rex is a zumpus, a lorpus, and a wumpus.","Rex is a zumpus."]}
{"input":"Context: Rompuses are vumpuses. Each lempus is a yumpus. Everything that is an impus, a zumpus, or a numpus is a tumpus. Each grimpus is a tumpus. Everything that is a lorpus or a gorpus or a brimpus is a numpus. Grimpuses are lempuses, rompuses, and lorpuses. Everything that is a lorpus, a gorpus, or a brimpus is a zumpus. Everything that is a lorpus or a yumpus or a wumpus is a vumpus. Wren is an impus. Wren is a grimpus.\nQuestion: Wren is a zumpus or a jompus or a dumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Wren is a grimpus.","Grimpuses are lempuses, rompuses, and lorpuses.","Wren is a lempus, a rompus, and a lorpus.","Wren is a lorpus.","Wren is a lorpus or a gorpus or a brimpus.","Everything that is a lorpus, a gorpus, or a brimpus is a zumpus.","Wren is a zumpus.","Wren is a zumpus or a jompus or a dumpus."]}
{"input":"Context: Everything that is a brimpus or a lempus or a rompus is a zumpus and a tumpus and a vumpus. Everything that is a rompus, a dumpus, or a lorpus is a jompus. Everything that is a brimpus or a lempus or a rompus is a sterpus. Everything that is an impus or a dumpus or a yumpus is a numpus. Everything that is a lempus, a grimpus, or a numpus is a shumpus. Everything that is a rompus, a dumpus, or a lorpus is a lempus. Zumpuses are grimpuses. Every vumpus is a yumpus. Polly is a yumpus. Polly is a dumpus.\nQuestion: Polly is a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a dumpus.","Polly is a rompus, a dumpus, or a lorpus.","Everything that is a rompus, a dumpus, or a lorpus is a lempus.","Polly is a lempus.","Polly is a brimpus, a lempus, or a rompus.","Everything that is a brimpus or a lempus or a rompus is a zumpus and a tumpus and a vumpus.","Polly is a zumpus and a tumpus and a vumpus.","Polly is a tumpus."]}
{"input":"Context: Each zumpus is a brimpus and a yumpus and a sterpus. Every yumpus is a tumpus. Every sterpus is a gorpus. Vumpuses are wumpuses. Sterpuses are lorpuses. Zumpuses are lorpuses. Each vumpus is a lempus, a zumpus, and a brimpus. Each wumpus is a brimpus. Lempuses are shumpuses. Each brimpus is a rompus. Alex is a wumpus. Every numpus is a shumpus. Alex is a rompus and an impus and a jompus. Alex is a numpus, Alex is not a brimpus, and Alex is a sterpus.\nQuestion: Alex is not a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Alex is a numpus and Alex is not a brimpus and Alex is a sterpus.","Alex is not a brimpus.\n\n","Assume Alex is a vumpus.","Each vumpus is a lempus, a zumpus, and a brimpus.","Alex is a lempus, a zumpus, and a brimpus.","Alex is a zumpus.","Each zumpus is a brimpus and a yumpus and a sterpus.","Alex is a brimpus, a yumpus, and a sterpus.","Alex is a brimpus.","This contradicts with Alex is not a brimpus.","Alex is not a vumpus.\n\n"]}
{"input":"Context: Each brimpus is a zumpus. Each lempus is an impus. Everything that is a wumpus, a numpus, and a lorpus is a jompus. Sam is a sterpus. Each jompus is a shumpus, a lempus, and a brimpus. Yumpuses are gorpuses. Each dumpus is an impus. Sterpuses are shumpuses. Everything that is a wumpus and a numpus and a lorpus is a rompus. Sam is a wumpus. Everything that is a gorpus and a wumpus and a sterpus is a zumpus. Jompuses are impuses. Sam is a gorpus. Sam is a zumpus and a grimpus and a rompus. Sam is a dumpus, Sam is a yumpus, and Sam is not a shumpus. Sam is a wumpus. Sam is a numpus.\nQuestion: Sam is not a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sam is a dumpus and Sam is a yumpus and Sam is not a shumpus.","Sam is not a shumpus.\n\n","Assume Sam is a lorpus.","Sam is a numpus.","Sam is a wumpus.","Sam is a wumpus, a numpus, and a lorpus.","Everything that is a wumpus, a numpus, and a lorpus is a jompus.","Sam is a jompus.","Each jompus is a shumpus, a lempus, and a brimpus.","Sam is a shumpus, a lempus, and a brimpus.","Sam is a shumpus.","This contradicts with Sam is not a shumpus.","Sam is not a lorpus.\n\n"]}
{"input":"Context: Dumpuses are rompuses, grimpuses, and wumpuses. Everything that is a numpus, a sterpus, or a rompus is a yumpus. Dumpuses are shumpuses. Everything that is a numpus or a sterpus or a rompus is a gorpus and a grimpus and a dumpus. Grimpuses are tumpuses. Every gorpus is a jompus. Wumpuses are impuses. Everything that is a rompus or a lorpus or a jompus is a vumpus. Fae is a tumpus. Fae is a dumpus.\nQuestion: Fae is a grimpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a dumpus.","Dumpuses are rompuses, grimpuses, and wumpuses.","Fae is a rompus, a grimpus, and a wumpus.","Fae is a rompus.","Fae is a numpus or a sterpus or a rompus.","Everything that is a numpus or a sterpus or a rompus is a gorpus and a grimpus and a dumpus.","Fae is a gorpus, a grimpus, and a dumpus.","Fae is a grimpus."]}
{"input":"Context: Each zumpus is a tumpus. Rex is a brimpus. Rex is a vumpus. Every yumpus is a dumpus. Numpuses are lorpuses. Rex is a rompus. Each wumpus is a vumpus. Everything that is a brimpus and a rompus and a vumpus is a dumpus. Everything that is a brimpus, a shumpus, and a grimpus is a dumpus. Lempuses are tumpuses. Everything that is a brimpus and a shumpus and a grimpus is a yumpus and a wumpus and a zumpus. Wumpuses are gorpuses, lempuses, and numpuses. Rex is a brimpus. Rex is a shumpus. Rex is a tumpus. Rex is a grimpus.\nQuestion: Rex is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a grimpus.","Rex is a shumpus.","Rex is a brimpus.","Rex is a brimpus, a shumpus, and a grimpus.","Everything that is a brimpus and a shumpus and a grimpus is a yumpus and a wumpus and a zumpus.","Rex is a yumpus, a wumpus, and a zumpus.","Rex is a wumpus.","Wumpuses are gorpuses, lempuses, and numpuses.","Rex is a gorpus and a lempus and a numpus.","Rex is a gorpus."]}
{"input":"Context: Max is a dumpus. Every rompus is a tumpus. Everything that is a brimpus and a vumpus and a grimpus is a lorpus, a rompus, and a lempus. Lorpuses are gorpuses. Every lempus is a jompus. Everything that is a brimpus and a vumpus and a grimpus is a tumpus. Max is a brimpus. Each lorpus is a shumpus and a numpus and a lempus. Everything that is a brimpus and a dumpus and a gorpus is a zumpus. Every lempus is an impus. Shumpuses are yumpuses. Max is a gorpus. Max is a brimpus. Max is a vumpus. Max is a yumpus. Max is a grimpus.\nQuestion: Max is a numpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Max is a grimpus.","Max is a vumpus.","Max is a brimpus.","Max is a brimpus, a vumpus, and a grimpus.","Everything that is a brimpus and a vumpus and a grimpus is a lorpus, a rompus, and a lempus.","Max is a lorpus and a rompus and a lempus.","Max is a lorpus.","Each lorpus is a shumpus and a numpus and a lempus.","Max is a shumpus and a numpus and a lempus.","Max is a numpus."]}
{"input":"Context: Everything that is a yumpus, a grimpus, or a brimpus is a dumpus. Everything that is a yumpus, a grimpus, or a brimpus is a shumpus. Each dumpus is an impus, a yumpus, and a rompus. Jompuses are vumpuses. Yumpuses are sterpuses. Every impus is a lempus. Yumpuses are lorpuses. Dumpuses are shumpuses. Everything that is a shumpus, a grimpus, or a wumpus is a tumpus. Polly is a lempus, a wumpus, and a gorpus. Polly is a yumpus, a jompus, and a grimpus.\nQuestion: Polly is a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a yumpus and a jompus and a grimpus.","Polly is a grimpus.","Polly is a yumpus or a grimpus or a brimpus.","Everything that is a yumpus, a grimpus, or a brimpus is a dumpus.","Polly is a dumpus.","Each dumpus is an impus, a yumpus, and a rompus.","Polly is an impus and a yumpus and a rompus.","Polly is a rompus."]}
{"input":"Context: Everything that is a yumpus, a rompus, and a vumpus is a sterpus. Tumpuses are lempuses. Lorpuses are wumpuses. Polly is a vumpus. Everything that is a yumpus, a shumpus, and a brimpus is a dumpus, a tumpus, and a lorpus. Polly is a yumpus. Every dumpus is a jompus and a shumpus and a tumpus. Dumpuses are sterpuses. Shumpuses are gorpuses. Jompuses are lempuses. Everything that is a yumpus, a shumpus, and a brimpus is a gorpus. Polly is a rompus. Polly is a zumpus. Polly is a yumpus. Polly is a shumpus. Polly is a brimpus.\nQuestion: Polly is a tumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Polly is a brimpus.","Polly is a shumpus.","Polly is a yumpus.","Polly is a yumpus and a shumpus and a brimpus.","Everything that is a yumpus, a shumpus, and a brimpus is a dumpus, a tumpus, and a lorpus.","Polly is a dumpus and a tumpus and a lorpus.","Polly is a dumpus.","Every dumpus is a jompus and a shumpus and a tumpus.","Polly is a jompus, a shumpus, and a tumpus.","Polly is a tumpus."]}
{"input":"Context: Each grimpus is a rompus. Jompuses are sterpuses. Everything that is a numpus or a tumpus or a wumpus is a shumpus, a dumpus, and a grimpus. Impuses are vumpuses. Dumpuses are sterpuses. Zumpuses are rompuses. Every zumpus is a wumpus, a jompus, and an impus. Everything that is a wumpus, a lorpus, or a yumpus is a lempus. Everything that is a numpus or a tumpus or a wumpus is a gorpus. Rex is a lempus. Rex is a zumpus.\nQuestion: Rex is a shumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a zumpus.","Every zumpus is a wumpus, a jompus, and an impus.","Rex is a wumpus, a jompus, and an impus.","Rex is a wumpus.","Rex is a numpus or a tumpus or a wumpus.","Everything that is a numpus or a tumpus or a wumpus is a shumpus, a dumpus, and a grimpus.","Rex is a shumpus, a dumpus, and a grimpus.","Rex is a shumpus."]}
{"input":"Context: Brimpuses are numpuses, sterpuses, and vumpuses. Everything that is a grimpus, a vumpus, or a lempus is a lorpus. Gorpuses are impuses. Dumpuses are tumpuses. Every numpus is an impus. Sterpuses are jompuses. Rompuses are lorpuses. Every gorpus is a rompus and a dumpus and a brimpus. Each brimpus is a jompus. Rex is a lempus. Rex is a gorpus.\nQuestion: Rex is a wumpus, a numpus, or a vumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a gorpus.","Every gorpus is a rompus and a dumpus and a brimpus.","Rex is a rompus, a dumpus, and a brimpus.","Rex is a brimpus.","Brimpuses are numpuses, sterpuses, and vumpuses.","Rex is a numpus and a sterpus and a vumpus.","Rex is a vumpus.","Rex is a wumpus or a numpus or a vumpus."]}
{"input":"Context: Every wumpus is a dumpus. Every lempus is a sterpus. Shumpuses are gorpuses. Everything that is a dumpus or a lorpus or a gorpus is a vumpus. Brimpuses are vumpuses. Every shumpus is a wumpus. Tumpuses are brimpuses and lempuses and shumpuses. Wumpuses are lorpuses. Tumpuses are numpuses. Sally is a numpus. Sally is a tumpus.\nQuestion: Sally is a zumpus, a lorpus, or a jompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Sally is a tumpus.","Tumpuses are brimpuses and lempuses and shumpuses.","Sally is a brimpus, a lempus, and a shumpus.","Sally is a shumpus.","Every shumpus is a wumpus.","Sally is a wumpus.","Wumpuses are lorpuses.","Sally is a lorpus.","Sally is a zumpus, a lorpus, or a jompus."]}
{"input":"Context: Everything that is a yumpus or a wumpus or a shumpus is a brimpus. Jompuses are shumpuses. Every impus is a sterpus. Numpuses are lorpuses. Lempuses are impuses. Everything that is a grimpus or a dumpus or a yumpus is a gorpus. Everything that is a grimpus or a dumpus or a yumpus is a lorpus. Lempuses are wumpuses. Impuses are jompuses, yumpuses, and numpuses. Fae is a shumpus. Fae is a lempus.\nQuestion: Fae is a gorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a lempus.","Lempuses are impuses.","Fae is an impus.","Impuses are jompuses, yumpuses, and numpuses.","Fae is a jompus, a yumpus, and a numpus.","Fae is a yumpus.","Fae is a grimpus or a dumpus or a yumpus.","Everything that is a grimpus or a dumpus or a yumpus is a gorpus.","Fae is a gorpus."]}
{"input":"Context: Everything that is a tumpus, an impus, or a shumpus is a yumpus. Everything that is a gorpus or a numpus or a sterpus is a tumpus. Vumpuses are zumpuses. Everything that is a gorpus or a numpus or a sterpus is a jompus. Lempuses are grimpuses. Lempuses are numpuses. Every rompus is a yumpus. Everything that is a zumpus, a numpus, or a wumpus is an impus. Rex is a yumpus, a wumpus, and a jompus. Rex is a lempus and a vumpus and a rompus.\nQuestion: Rex is a lorpus or a tumpus or a dumpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Rex is a lempus, a vumpus, and a rompus.","Rex is a lempus.","Lempuses are numpuses.","Rex is a numpus.","Rex is a gorpus or a numpus or a sterpus.","Everything that is a gorpus or a numpus or a sterpus is a tumpus.","Rex is a tumpus.","Rex is a lorpus, a tumpus, or a dumpus."]}
{"input":"Context: Everything that is a lorpus, a sterpus, or a lempus is a rompus, a numpus, and a brimpus. Everything that is a lempus, a vumpus, or a jompus is a dumpus. Gorpuses are grimpuses. Tumpuses are dumpuses. Rompuses are grimpuses. Numpuses are yumpuses. Gorpuses are rompuses and tumpuses and lempuses. Everything that is a lorpus, a sterpus, or a lempus is a shumpus. Brimpuses are grimpuses. Fae is a vumpus. Fae is a gorpus.\nQuestion: Fae is a rompus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a gorpus.","Gorpuses are rompuses and tumpuses and lempuses.","Fae is a rompus, a tumpus, and a lempus.","Fae is a lempus.","Fae is a lorpus, a sterpus, or a lempus.","Everything that is a lorpus, a sterpus, or a lempus is a rompus, a numpus, and a brimpus.","Fae is a rompus and a numpus and a brimpus.","Fae is a rompus."]}
{"input":"Context: Everything that is a tumpus, a sterpus, and a zumpus is a grimpus and an impus and a wumpus. Fae is a dumpus. Each yumpus is a vumpus. Everything that is a lempus, a tumpus, and a dumpus is a brimpus. Every wumpus is a jompus. Impuses are grimpuses and yumpuses and lorpuses. Each grimpus is a brimpus. Every grimpus is a rompus. Everything that is a tumpus and a sterpus and a zumpus is a vumpus. Fae is a lempus. Fae is a tumpus. Impuses are dumpuses. Fae is a shumpus. Fae is a tumpus. Fae is a sterpus. Fae is a zumpus.\nQuestion: Fae is a lorpus. Is the Question True or False?\nOptions:\n 0). True\n 1). False\nPlease select the correct option.","answer_text":"True","ground_truth_cots":["Fae is a zumpus.","Fae is a sterpus.","Fae is a tumpus.","Fae is a tumpus and a sterpus and a zumpus.","Everything that is a tumpus, a sterpus, and a zumpus is a grimpus and an impus and a wumpus.","Fae is a grimpus, an impus, and a wumpus.","Fae is an impus.","Impuses are grimpuses and yumpuses and lorpuses.","Fae is a grimpus, a yumpus, and a lorpus.","Fae is a lorpus."]}
