{
  "id": "05_abductive",
  "name": "Abductive Reasoning - Finding Explanations",
  "description": "Tests inference to the best explanation and hypothesis generation",

  "theory": {
    "natural_language": "In medical diagnosis, certain symptoms point to specific conditions. Fever can be caused by infection, inflammation, or heatstroke. Coughing is often caused by respiratory infection, allergies, or smoking. Headaches can result from stress, dehydration, or high blood pressure. When someone has both fever and coughing together, respiratory infection is the most likely cause. Fatigue can be caused by lack of sleep, anemia, or infection. If a patient has fever, coughing, and fatigue all together, influenza is a strong possibility. Food poisoning causes stomach pain, nausea, and fever. A patient named John came in with fever and coughing.",
    "expected_facts": [
      "Infection CAUSES Fever",
      "Inflammation CAUSES Fever",
      "Heatstroke CAUSES Fever",
      "RespiratoryInfection CAUSES Coughing",
      "Allergies CAUSES Coughing",
      "Smoking CAUSES Coughing",
      "Stress CAUSES Headache",
      "Dehydration CAUSES Headache",
      "HighBloodPressure CAUSES Headache",
      "RespiratoryInfection CAUSES Fever",
      "RespiratoryInfection CAUSES Coughing",
      "LackOfSleep CAUSES Fatigue",
      "Anemia CAUSES Fatigue",
      "Infection CAUSES Fatigue",
      "Influenza CAUSES Fever",
      "Influenza CAUSES Coughing",
      "Influenza CAUSES Fatigue",
      "FoodPoisoning CAUSES StomachPain",
      "FoodPoisoning CAUSES Nausea",
      "FoodPoisoning CAUSES Fever",
      "John HAS_SYMPTOM Fever",
      "John HAS_SYMPTOM Coughing"
    ]
  },

  "queries": [
    {
      "id": "q1",
      "natural_language": "What could be causing John's symptoms?",
      "expected_answer": {
        "natural_language": "Based on John's symptoms of fever and coughing, the most likely cause is a respiratory infection. Influenza is also possible but typically includes fatigue as well.",
        "truth": "PLAUSIBLE",
        "explanation": "Abductive: RespiratoryInfection explains both Fever and Coughing"
      }
    },
    {
      "id": "q2",
      "natural_language": "If John also has fatigue, what is the most likely diagnosis?",
      "expected_answer": {
        "natural_language": "If John has fever, coughing, and fatigue together, influenza is the most likely diagnosis as it explains all three symptoms.",
        "truth": "TRUE_CERTAIN",
        "explanation": "Influenza CAUSES all three symptoms - best explanation"
      }
    },
    {
      "id": "q3",
      "natural_language": "Could John have food poisoning?",
      "expected_answer": {
        "natural_language": "Food poisoning is unlikely. While it can cause fever, it typically causes stomach pain and nausea, not coughing. John has coughing but no reported stomach issues.",
        "truth": "FALSE",
        "explanation": "FoodPoisoning causes Fever but not Coughing; doesn't explain all symptoms"
      }
    }
  ],

  "tags": ["abductive", "medical", "diagnosis", "explanation", "hypotheses"]
}
