{
  "id": "08_multi_theory",
  "name": "Multiple Theory Layers and Context Switching",
  "description": "Tests reasoning with multiple overlapping theory contexts",

  "theory": {
    "natural_language": "In standard physics, we have certain well-established laws. Light travels at approximately 300,000 kilometers per second in a vacuum - this is the speed of light. Nothing can travel faster than light according to Einstein's theory of relativity. The distance from the Sun to Earth is about 150 million kilometers, which means light takes about 8 minutes to travel from the Sun to Earth.\n\nHowever, in science fiction scenarios, we often imagine faster-than-light travel. In Star Trek, warp drive allows ships to travel faster than light. In Star Wars, hyperspace jumps can cross the galaxy in hours. These are fictional technologies that don't exist in our real physics.\n\nIn quantum mechanics, we have a different perspective. Quantum entanglement allows particles to be correlated instantly regardless of distance - but this doesn't actually transmit information faster than light.\n\nFor our current analysis, let's consider that we're operating under standard physics unless otherwise specified.",
    "expected_facts": [
      "Light TRAVELS_AT SpeedOfLight",
      "SpeedOfLight EQUALS KmPerSecond300000",
      "Nothing FASTER_THAN Light",
      "SunToEarthDistance EQUALS Km150000000",
      "SunToEarthLightTime EQUALS Minutes8",
      "WarpDrive ENABLES FasterThanLight",
      "WarpDrive IS_A SciFiTechnology",
      "Hyperspace ENABLES GalaxyTravel",
      "Hyperspace IS_A SciFiTechnology",
      "QuantumEntanglement ALLOWS InstantCorrelation",
      "QuantumEntanglement NOT_ALLOWS InformationTransfer"
    ]
  },

  "queries": [
    {
      "id": "q1",
      "natural_language": "How long does it take for light to reach Earth from the Sun?",
      "expected_answer": {
        "natural_language": "Light takes about 8 minutes to travel from the Sun to Earth.",
        "truth": "TRUE_CERTAIN",
        "explanation": "Direct fact: SunToEarthLightTime EQUALS Minutes8"
      }
    },
    {
      "id": "q2",
      "natural_language": "In the Star Trek universe, can ships travel faster than light?",
      "expected_answer": {
        "natural_language": "Yes, in the Star Trek universe, ships can travel faster than light using warp drive technology. However, this is science fiction and doesn't apply to real physics.",
        "truth": "TRUE_CERTAIN",
        "explanation": "Within SciFi context: WarpDrive ENABLES FasterThanLight"
      }
    },
    {
      "id": "q3",
      "natural_language": "Can quantum entanglement be used to communicate faster than light?",
      "expected_answer": {
        "natural_language": "No, quantum entanglement cannot be used to communicate faster than light. While entangled particles show instant correlation, this cannot be used to transmit actual information faster than light.",
        "truth": "FALSE",
        "explanation": "QuantumEntanglement NOT_ALLOWS InformationTransfer"
      }
    }
  ],

  "tags": ["multi-theory", "context", "physics", "scifi", "quantum"]
}
