{
  "id": "07_conflict_detection",
  "name": "Conflict Detection and Resolution",
  "description": "Tests the system's ability to detect contradictions and logical conflicts",

  "theory": {
    "natural_language": "Let me tell you about Socrates and the nature of mortality. All humans are mortal - this is a fundamental truth. Socrates is a human, therefore Socrates is mortal. Now, the Greek gods were considered immortal - they could not die. Zeus is a god, so Zeus is immortal. Here's an interesting philosophical puzzle: some ancient texts suggest that Socrates had divine wisdom, almost as if he were touched by the gods. But being mortal and being immortal are contradictory properties - nothing can be both mortal and immortal at the same time. A being is either one or the other. Also, all mortals will eventually die, while immortals live forever. Death and eternal life are mutually exclusive.",
    "expected_facts": [
      "human IS_A mortal",
      "Socrates IS_A human",
      "Socrates IS_A mortal",
      "god IS_A immortal",
      "Zeus IS_A god",
      "Zeus IS_A immortal",
      "mortal DISJOINT_WITH immortal",
      "mortal WILL_EVENTUALLY die",
      "immortal LIVES forever"
    ]
  },

  "queries": [
    {
      "id": "q1",
      "natural_language": "Is Socrates immortal?",
      "expected_answer": {
        "natural_language": "No, Socrates is not immortal. Socrates is a human, humans are mortal, and mortal is the opposite of immortal.",
        "truth": "FALSE",
        "explanation": "Socrates IS_A human, human IS_A mortal, mortal DISJOINT_WITH immortal"
      }
    },
    {
      "id": "q2",
      "natural_language": "Would there be a contradiction if we said Socrates is a god?",
      "expected_answer": {
        "natural_language": "Yes, there would be a contradiction. If Socrates were a god, he would be immortal (since gods are immortal). But Socrates is already established as mortal (being human). Since mortal and immortal are contradictory, claiming Socrates is a god creates a logical conflict.",
        "truth": "TRUE_CERTAIN",
        "explanation": "CHECK_WOULD_CONTRADICT: Socrates IS_A mortal + god IS_A immortal + mortal DISJOINT_WITH immortal"
      }
    },
    {
      "id": "q3",
      "natural_language": "Can Zeus die?",
      "expected_answer": {
        "natural_language": "No, Zeus cannot die. Zeus is a god, gods are immortal, and immortals live forever. Death is only for mortals.",
        "truth": "FALSE",
        "explanation": "Zeus IS_A immortal, immortals do not die"
      }
    }
  ],

  "tags": ["conflict", "contradiction", "disjoint", "logic", "mortality"]
}
