{
  "id": "06_analogy",
  "name": "Analogical Reasoning - Structural Mapping",
  "description": "Tests the ability to transfer relations between domains through analogical reasoning",

  "theory": {
    "natural_language": "In a kingdom, the king rules over the kingdom and makes decisions for its people. The king lives in a castle and wears a crown as a symbol of authority. Similarly, in a company, the CEO leads the company and makes decisions for its employees. The CEO works in the headquarters. In a family, the parent guides the family and makes decisions for the children. The parent lives in the family home. In ancient Rome, the emperor ruled over the empire. The emperor lived in a palace. We can see a pattern here: in each domain, there is a leader figure who has authority over a group and occupies a special place. The relationship between a teacher and a classroom is similar - the teacher leads the classroom and guides the students in their learning journey.",
    "expected_facts": [
      "King RULES Kingdom",
      "King LIVES_IN Castle",
      "King WEARS Crown",
      "CEO LEADS Company",
      "CEO WORKS_IN Headquarters",
      "Parent GUIDES Family",
      "Parent LIVES_IN FamilyHome",
      "Emperor RULED Empire",
      "Emperor LIVED_IN Palace",
      "Teacher LEADS Classroom",
      "Teacher GUIDES Students"
    ]
  },

  "queries": [
    {
      "id": "q1",
      "natural_language": "If a king is to a kingdom as a CEO is to a company, what is a president to?",
      "expected_answer": {
        "natural_language": "A president is to a country or republic. Following the pattern, a president leads and governs a country, similar to how a king rules a kingdom and a CEO leads a company.",
        "truth": "PLAUSIBLE",
        "explanation": "Analogical transfer: King:Kingdom :: CEO:Company :: President:Country"
      }
    },
    {
      "id": "q2",
      "natural_language": "Based on the pattern, where would a captain likely work?",
      "expected_answer": {
        "natural_language": "A captain would likely work on a ship or in a vessel. Following the analogy where leaders have their designated places (king-castle, CEO-headquarters), a captain's place is a ship.",
        "truth": "PLAUSIBLE",
        "explanation": "Spatial analogy: King:Castle :: CEO:Headquarters :: Captain:Ship"
      }
    },
    {
      "id": "q3",
      "natural_language": "What relation does a conductor have to an orchestra?",
      "expected_answer": {
        "natural_language": "A conductor leads the orchestra, similar to how a king rules a kingdom or a CEO leads a company. The conductor guides the musicians in creating music together.",
        "truth": "PLAUSIBLE",
        "explanation": "Leadership analogy transfer"
      }
    }
  ],

  "tags": ["analogy", "structure-mapping", "transfer", "leadership"]
}
